MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D33.atdf
      <value-group caption="" name="ADC_MR__ANACH">
        <value caption="No analog change on channel switching: DIFF0, GAIN0 and OFF0 are used for all channels" name="NONE" value="0"/>
        <value caption="Allows different analog settings for each channel. See ADC_CGR and ADC_COR Registers" name="ALLOWED" value="1"/>
      </value-group>
      <value-group caption="" name="ADC_MR__USEQ">
        <value caption="Normal Mode: The controller converts channels in a simple numeric order depending only on the channel index." name="NUM_ORDER" value="0"/>
        <value caption="User Sequence Mode: The sequence respects what is defined in ADC_SEQR1 and ADC_SEQR2 registers and can be used to convert several times the same channel." name="REG_ORDER" value="1"/>
      </value-group>
      <value-group caption="" name="ADC_EMR__CMPMODE">
        <value caption="Generates an event when the converted data is lower than the low threshold of the window." name="LOW" value="0x0"/>
        <value caption="Generates an event when the converted data is higher than the high threshold of the window." name="HIGH" value="0x1"/>
        <value caption="Generates an event when the converted data is in the comparison window." name="IN" value="0x2"/>
        <value caption="Generates an event when the converted data is out of the comparison window." name="OUT" value="0x3"/>
      </value-group>
      <value-group caption="" name="ADC_TSMR__TSMODE">
        <value caption="No Touchscreen" name="NONE" value="0x0"/>
        <value caption="4-wire Touchscreen without pressure measurement" name="_4_WIRE_NO_PM" value="0x1"/>
        <value caption="4-wire Touchscreen with pressure measurement" name="_4_WIRE" value="0x2"/>
        <value caption="5-wire Touchscreen" name="_5_WIRE" value="0x3"/>
      </value-group>
      <value-group caption="" name="ADC_TSMR__TSAV">
        <value caption="No Filtering. Only one ADC conversion per measure" name="NO_FILTER" value="0x0"/>
        <value caption="Averages 2 ADC conversions" name="AVG2CONV" value="0x1"/>
        <value caption="Averages 4 ADC conversions" name="AVG4CONV" value="0x2"/>
        <value caption="Averages 8 ADC conversions" name="AVG8CONV" value="0x3"/>
      </value-group>
      <value-group caption="" name="ADC_TRGR__TRGMOD">
        <value caption="No trigger, only software trigger can start conversions" name="NO_TRIGGER" value="0x0"/>
        <value caption="External Trigger Rising Edge" name="EXT_TRIG_RISE" value="0x1"/>
        <value caption="External Trigger Falling Edge" name="EXT_TRIG_FALL" value="0x2"/>
        <value caption="External Trigger Any Edge" name="EXT_TRIG_ANY" value="0x3"/>
        <value caption="Pen Detect Trigger (shall be selected only if PENDET is set and TSAMOD = Touchscreen only mode)" name="PEN_TRIG" value="0x4"/>
        <value caption="Periodic Trigger (TRGPER shall be initiated appropriately)" name="PERIOD_TRIG" value="0x5"/>
        <value caption="Continuous Mode" name="CONTINUOUS" value="0x6"/>
      </value-group>
    </module>
    <module caption="Advanced Interrupt Controller" name="AIC" version="11051B">
      <register-group name="AIC">
        <register caption="Source Select Register" name="AIC_SSR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Interrupt line Selection" mask="0x0000007F" name="INTSEL"/>
        </register>
        <register caption="Source Mode Register" name="AIC_SMR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Priority Level" mask="0x00000007" name="PRIOR"/>
          <bitfield caption="Interrupt Source Type" mask="0x00000060" name="SRCTYPE" values="AIC_SMR__SRCTYPE"/>
        </register>
        <register caption="Source Vector Register" name="AIC_SVR" offset="0x08" rw="RW" size="4">
          <bitfield caption="Source Vector" mask="0xFFFFFFFF" name="VECTOR"/>
        </register>
        <register caption="Interrupt Vector Register" name="AIC_IVR" offset="0x10" rw="R" size="4">
          <bitfield caption="Interrupt Vector Register" mask="0xFFFFFFFF" name="IRQV"/>
        </register>
        <register caption="FIQ Interrupt Vector Register" name="AIC_FVR" offset="0x14" rw="R" size="4">
          <bitfield caption="FIQ Vector Register" mask="0xFFFFFFFF" name="FIQV"/>
        </register>
        <register caption="Interrupt Status Register" name="AIC_ISR" offset="0x18" rw="R" size="4">
          <bitfield caption="Current Interrupt Identifier" mask="0x0000007F" name="IRQID"/>
        </register>
        <register caption="Interrupt Pending Register 0" name="AIC_IPR0" offset="0x20" rw="R" size="4">
          <bitfield caption="Interrupt Pending" mask="0x00000001" name="FIQ"/>
          <bitfield caption="Interrupt Pending" mask="0x00000002" name="SYS"/>
          <bitfield caption="Interrupt Pending" mask="0x00000004" name="PID2"/>
          <bitfield caption="Interrupt Pending" mask="0x00000008" name="PID3"/>
          <bitfield caption="Interrupt Pending" mask="0x00000010" name="PID4"/>
          <bitfield caption="Interrupt Pending" mask="0x00000020" name="PID5"/>
          <bitfield caption="Interrupt Pending" mask="0x00000040" name="PID6"/>
          <bitfield caption="Interrupt Pending" mask="0x00000080" name="PID7"/>
          <bitfield caption="Interrupt Pending" mask="0x00000100" name="PID8"/>
          <bitfield caption="Interrupt Pending" mask="0x00000200" name="PID9"/>
          <bitfield caption="Interrupt Pending" mask="0x00000400" name="PID10"/>
          <bitfield caption="Interrupt Pending" mask="0x00000800" name="PID11"/>
          <bitfield caption="Interrupt Pending" mask="0x00001000" name="PID12"/>
          <bitfield caption="Interrupt Pending" mask="0x00002000" name="PID13"/>
          <bitfield caption="Interrupt Pending" mask="0x00004000" name="PID14"/>
          <bitfield caption="Interrupt Pending" mask="0x00008000" name="PID15"/>
          <bitfield caption="Interrupt Pending" mask="0x00010000" name="PID16"/>
          <bitfield caption="Interrupt Pending" mask="0x00020000" name="PID17"/>
          <bitfield caption="Interrupt Pending" mask="0x00040000" name="PID18"/>
          <bitfield caption="Interrupt Pending" mask="0x00080000" name="PID19"/>
          <bitfield caption="Interrupt Pending" mask="0x00100000" name="PID20"/>
          <bitfield caption="Interrupt Pending" mask="0x00200000" name="PID21"/>
          <bitfield caption="Interrupt Pending" mask="0x00400000" name="PID22"/>
          <bitfield caption="Interrupt Pending" mask="0x00800000" name="PID23"/>
          <bitfield caption="Interrupt Pending" mask="0x01000000" name="PID24"/>
          <bitfield caption="Interrupt Pending" mask="0x02000000" name="PID25"/>
          <bitfield caption="Interrupt Pending" mask="0x04000000" name="PID26"/>
          <bitfield caption="Interrupt Pending" mask="0x08000000" name="PID27"/>
          <bitfield caption="Interrupt Pending" mask="0x10000000" name="PID28"/>
          <bitfield caption="Interrupt Pending" mask="0x20000000" name="PID29"/>
          <bitfield caption="Interrupt Pending" mask="0x40000000" name="PID30"/>
          <bitfield caption="Interrupt Pending" mask="0x80000000" name="PID31"/>
        </register>
