MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D33.atdf
        <register caption="ASIB0 Read Channel QoS Register" name="AXIMX_ASIB0_READ_QOS" offset="0x42100" rw="RW" size="4">
          <bitfield caption="Read QoS" mask="0x0000000F" name="RD_QOS"/>
        </register>
        <register caption="ASIB0 Write Channel QoS Register" name="AXIMX_ASIB0_WRITE_QOS" offset="0x42104" rw="RW" size="4">
          <bitfield caption="Write QoS" mask="0x0000000F" name="WR_QOS"/>
        </register>
        <register caption="ASIB1 AHB Functionality Modification Register" name="AXIMX_ASIB1_FN_MOD_AHB" offset="0x43028" rw="RW" size="4">
          <bitfield caption="Read INCR Override" mask="0x00000001" name="RD_INCR_OVR"/>
          <bitfield caption="Write INCR override" mask="0x00000002" name="WR_INCR_OVR"/>
          <bitfield caption="Lock Override" mask="0x00000004" name="LOCK_OVR"/>
        </register>
        <register caption="ASIB1 Read Channel QoS Register" name="AXIMX_ASIB1_READ_QOS" offset="0x43100" rw="RW" size="4">
          <bitfield caption="Read QoS" mask="0x0000000F" name="RD_QOS"/>
        </register>
        <register caption="ASIB1 Write Channel QoS Register" name="AXIMX_ASIB1_WRITE_QOS" offset="0x43104" rw="RW" size="4">
          <bitfield caption="Write QoS" mask="0x0000000F" name="WR_QOS"/>
        </register>
        <register caption="ASIB1 Issuing Functionality Modification Register" name="AXIMX_ASIB1_FN_MOD" offset="0x43108" rw="RW" size="4">
          <bitfield caption="Read Issuing" mask="0x00000001" name="RD_ISS"/>
          <bitfield caption="Write Issuing" mask="0x00000002" name="WR_ISS"/>
        </register>
      </register-group>
      <value-group caption="" name="AXIMX_PERIPH_ID4__ID">
        <value caption="Part Number" name="ID0" value="0x01"/>
        <value caption="4KB count, JEP106 continuation code" name="ID4" value="0x04"/>
        <value caption="JEP106[3:0, part number[11:8]" name="ID1" value="0xB3"/>
        <value caption="Revision, JEP106 code flag, JEP106[6:4]" name="ID2" value="0xB6"/>
      </value-group>
      <value-group caption="" name="AXIMX_PERIPH_ID5__ID">
        <value caption="Part Number" name="ID0" value="0x01"/>
        <value caption="4KB count, JEP106 continuation code" name="ID4" value="0x04"/>
        <value caption="JEP106[3:0, part number[11:8]" name="ID1" value="0xB3"/>
        <value caption="Revision, JEP106 code flag, JEP106[6:4]" name="ID2" value="0xB6"/>
      </value-group>
      <value-group caption="" name="AXIMX_PERIPH_ID6__ID">
        <value caption="Part Number" name="ID0" value="0x01"/>
        <value caption="4KB count, JEP106 continuation code" name="ID4" value="0x04"/>
        <value caption="JEP106[3:0, part number[11:8]" name="ID1" value="0xB3"/>
        <value caption="Revision, JEP106 code flag, JEP106[6:4]" name="ID2" value="0xB6"/>
      </value-group>
      <value-group caption="" name="AXIMX_PERIPH_ID7__ID">
        <value caption="Part Number" name="ID0" value="0x01"/>
        <value caption="4KB count, JEP106 continuation code" name="ID4" value="0x04"/>
        <value caption="JEP106[3:0, part number[11:8]" name="ID1" value="0xB3"/>
        <value caption="Revision, JEP106 code flag, JEP106[6:4]" name="ID2" value="0xB6"/>
      </value-group>
      <value-group caption="" name="AXIMX_PERIPH_ID0__ID">
        <value caption="Part Number" name="ID0" value="0x01"/>
        <value caption="4KB count, JEP106 continuation code" name="ID4" value="0x04"/>
        <value caption="JEP106[3:0, part number[11:8]" name="ID1" value="0xB3"/>
        <value caption="Revision, JEP106 code flag, JEP106[6:4]" name="ID2" value="0xB6"/>
      </value-group>
      <value-group caption="" name="AXIMX_PERIPH_ID1__ID">
        <value caption="Part Number" name="ID0" value="0x01"/>
        <value caption="4KB count, JEP106 continuation code" name="ID4" value="0x04"/>
        <value caption="JEP106[3:0, part number[11:8]" name="ID1" value="0xB3"/>
        <value caption="Revision, JEP106 code flag, JEP106[6:4]" name="ID2" value="0xB6"/>
      </value-group>
      <value-group caption="" name="AXIMX_PERIPH_ID2__ID">
        <value caption="Part Number" name="ID0" value="0x01"/>
        <value caption="4KB count, JEP106 continuation code" name="ID4" value="0x04"/>
        <value caption="JEP106[3:0, part number[11:8]" name="ID1" value="0xB3"/>
        <value caption="Revision, JEP106 code flag, JEP106[6:4]" name="ID2" value="0xB6"/>
      </value-group>
      <value-group caption="" name="AXIMX_PERIPH_ID3__ID">
        <value caption="Part Number" name="ID0" value="0x01"/>
        <value caption="4KB count, JEP106 continuation code" name="ID4" value="0x04"/>
        <value caption="JEP106[3:0, part number[11:8]" name="ID1" value="0xB3"/>
        <value caption="Revision, JEP106 code flag, JEP106[6:4]" name="ID2" value="0xB6"/>
      </value-group>
    </module>
    <module caption="Boot Sequence Controller" name="BSC" version="11072B">
      <register-group name="BSC">
        <register caption="Boot Sequence Configuration Register" name="BSC_CR" offset="0x0" rw="RW" size="4">
          <bitfield caption="Boot media sequence" mask="0x000000FF" name="BOOT"/>
          <bitfield caption="" mask="0xFFFF0000" name="BOOTKEY" values="BSC_CR__BOOTKEY"/>
        </register>
      </register-group>
      <value-group caption="" name="BSC_CR__BOOTKEY">
        <value caption="valid key to write BSC_CR register; it needs to be written at the same time as the BOOT field." name="BSC_KEY" value="0x6683"/>
      </value-group>
    </module>
    <module caption="Debug Unit" name="DBGU" version="6059M">
      <register-group name="DBGU">
        <register caption="Control Register" name="DBGU_CR" offset="0x0000" rw="W" size="4">
          <bitfield caption="Reset Receiver" mask="0x00000004" name="RSTRX"/>
          <bitfield caption="Reset Transmitter" mask="0x00000008" name="RSTTX"/>
          <bitfield caption="Receiver Enable" mask="0x00000010" name="RXEN"/>
          <bitfield caption="Receiver Disable" mask="0x00000020" name="RXDIS"/>
          <bitfield caption="Transmitter Enable" mask="0x00000040" name="TXEN"/>
          <bitfield caption="Transmitter Disable" mask="0x00000080" name="TXDIS"/>
          <bitfield caption="Reset Status Bits" mask="0x00000100" name="RSTSTA"/>
        </register>
        <register caption="Mode Register" name="DBGU_MR" offset="0x0004" rw="RW" size="4">
          <bitfield caption="Parity Type" mask="0x00000E00" name="PAR" values="DBGU_MR__PAR"/>
          <bitfield caption="Channel Mode" mask="0x0000C000" name="CHMODE" values="DBGU_MR__CHMODE"/>
        </register>
        <register caption="Interrupt Enable Register" name="DBGU_IER" offset="0x0008" rw="W" size="4">
          <bitfield caption="Enable RXRDY Interrupt" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="Enable TXRDY Interrupt" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Enable Overrun Error Interrupt" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Enable Framing Error Interrupt" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Enable Parity Error Interrupt" mask="0x00000080" name="PARE"/>
          <bitfield caption="Enable TXEMPTY Interrupt" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Enable COMMTX (from ARM) Interrupt" mask="0x40000000" name="COMMTX"/>
          <bitfield caption="Enable COMMRX (from ARM) Interrupt" mask="0x80000000" name="COMMRX"/>
        </register>
        <register caption="Interrupt Disable Register" name="DBGU_IDR" offset="0x000C" rw="W" size="4">
          <bitfield caption="Disable RXRDY Interrupt" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="Disable TXRDY Interrupt" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Disable Overrun Error Interrupt" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Disable Framing Error Interrupt" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Disable Parity Error Interrupt" mask="0x00000080" name="PARE"/>
          <bitfield caption="Disable TXEMPTY Interrupt" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Disable COMMTX (from ARM) Interrupt" mask="0x40000000" name="COMMTX"/>
          <bitfield caption="Disable COMMRX (from ARM) Interrupt" mask="0x80000000" name="COMMRX"/>
        </register>
        <register caption="Interrupt Mask Register" name="DBGU_IMR" offset="0x0010" rw="R" size="4">
          <bitfield caption="Mask RXRDY Interrupt" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="Disable TXRDY Interrupt" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Mask Overrun Error Interrupt" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Mask Framing Error Interrupt" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Mask Parity Error Interrupt" mask="0x00000080" name="PARE"/>
          <bitfield caption="Mask TXEMPTY Interrupt" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Mask COMMTX Interrupt" mask="0x40000000" name="COMMTX"/>
          <bitfield caption="Mask COMMRX Interrupt" mask="0x80000000" name="COMMRX"/>
        </register>
