MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D33.atdf
        <register caption="Interrupt Status Register Priority Queue 0" name="GMAC_ISRPQ0" offset="0x400" rw="R" size="4">
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="Retry Limit Exceeded or Late Collision" mask="0x00000020" name="RLEX"/>
          <bitfield caption="Transmit Frame Corruption due to AHB error" mask="0x00000040" name="TFC"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
        </register>
        <register caption="Interrupt Status Register Priority Queue 1" name="GMAC_ISRPQ1" offset="0x404" rw="R" size="4">
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="Retry Limit Exceeded or Late Collision" mask="0x00000020" name="RLEX"/>
          <bitfield caption="Transmit Frame Corruption due to AHB error" mask="0x00000040" name="TFC"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
        </register>
        <register caption="Interrupt Status Register Priority Queue 2" name="GMAC_ISRPQ2" offset="0x408" rw="R" size="4">
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="Retry Limit Exceeded or Late Collision" mask="0x00000020" name="RLEX"/>
          <bitfield caption="Transmit Frame Corruption due to AHB error" mask="0x00000040" name="TFC"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
        </register>
        <register caption="Interrupt Status Register Priority Queue 3" name="GMAC_ISRPQ3" offset="0x40C" rw="R" size="4">
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="Retry Limit Exceeded or Late Collision" mask="0x00000020" name="RLEX"/>
          <bitfield caption="Transmit Frame Corruption due to AHB error" mask="0x00000040" name="TFC"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
        </register>
        <register caption="Interrupt Status Register Priority Queue 4" name="GMAC_ISRPQ4" offset="0x410" rw="R" size="4">
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="Retry Limit Exceeded or Late Collision" mask="0x00000020" name="RLEX"/>
          <bitfield caption="Transmit Frame Corruption due to AHB error" mask="0x00000040" name="TFC"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
        </register>
        <register caption="Interrupt Status Register Priority Queue 5" name="GMAC_ISRPQ5" offset="0x414" rw="R" size="4">
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="Retry Limit Exceeded or Late Collision" mask="0x00000020" name="RLEX"/>
          <bitfield caption="Transmit Frame Corruption due to AHB error" mask="0x00000040" name="TFC"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
        </register>
        <register caption="Interrupt Status Register Priority Queue 6" name="GMAC_ISRPQ6" offset="0x418" rw="R" size="4">
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="Retry Limit Exceeded or Late Collision" mask="0x00000020" name="RLEX"/>
          <bitfield caption="Transmit Frame Corruption due to AHB error" mask="0x00000040" name="TFC"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
        </register>
        <register caption="Transmit Buffer Queue Base Address Priority Queue 0" name="GMAC_TBQBAPQ0" offset="0x440" rw="RW" size="4">
          <bitfield caption="Transmit Buffer Queue Base Address" mask="0x000000FC" name="TXBQBA"/>
        </register>
        <register caption="Transmit Buffer Queue Base Address Priority Queue 1" name="GMAC_TBQBAPQ1" offset="0x444" rw="RW" size="4">
          <bitfield caption="Transmit Buffer Queue Base Address" mask="0x000000FC" name="TXBQBA"/>
        </register>
        <register caption="Transmit Buffer Queue Base Address Priority Queue 2" name="GMAC_TBQBAPQ2" offset="0x448" rw="RW" size="4">
          <bitfield caption="Transmit Buffer Queue Base Address" mask="0x000000FC" name="TXBQBA"/>
        </register>
        <register caption="Transmit Buffer Queue Base Address Priority Queue 3" name="GMAC_TBQBAPQ3" offset="0x44C" rw="RW" size="4">
          <bitfield caption="Transmit Buffer Queue Base Address" mask="0x000000FC" name="TXBQBA"/>
        </register>
        <register caption="Transmit Buffer Queue Base Address Priority Queue 4" name="GMAC_TBQBAPQ4" offset="0x450" rw="RW" size="4">
          <bitfield caption="Transmit Buffer Queue Base Address" mask="0x000000FC" name="TXBQBA"/>
        </register>
        <register caption="Transmit Buffer Queue Base Address Priority Queue 5" name="GMAC_TBQBAPQ5" offset="0x454" rw="RW" size="4">
          <bitfield caption="Transmit Buffer Queue Base Address" mask="0x000000FC" name="TXBQBA"/>
        </register>
