MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D33.atdf
        <register caption="LCD Controller Interrupt Status Register" name="LCDC_LCDISR" offset="0x00000038" rw="R" size="4">
          <bitfield caption="Start of Frame Interrupt Status Register" mask="0x00000001" name="SOF"/>
          <bitfield caption="LCD Disable Interrupt Status Register" mask="0x00000002" name="DIS"/>
          <bitfield caption="Power-up/Power-down Sequence Terminated Interrupt Status Register" mask="0x00000004" name="DISP"/>
          <bitfield caption="Output FIFO Error" mask="0x00000010" name="FIFOERR"/>
          <bitfield caption="Base Layer Raw Interrupt Status Register" mask="0x00000100" name="BASE"/>
          <bitfield caption="Overlay 1 Raw Interrupt Status Register" mask="0x00000200" name="OVR1"/>
          <bitfield caption="Overlay 2 Raw Interrupt Status Register" mask="0x00000400" name="OVR2"/>
          <bitfield caption="High End Overlay Raw Interrupt Status Register" mask="0x00000800" name="HEO"/>
          <bitfield caption="Hardware Cursor Raw Interrupt Status Register" mask="0x00001000" name="HCR"/>
          <bitfield caption="Post Processing Raw Interrupt Status Register" mask="0x00002000" name="PP"/>
        </register>
        <register caption="Base Layer Channel Enable Register" name="LCDC_BASECHER" offset="0x00000040" rw="W" size="4">
          <bitfield caption="Channel Enable Register" mask="0x00000001" name="CHEN"/>
          <bitfield caption="Update Overlay Attributes Enable Register" mask="0x00000002" name="UPDATEEN"/>
          <bitfield caption="Add Head Pointer Enable Register" mask="0x00000004" name="A2QEN"/>
        </register>
        <register caption="Base Layer Channel Disable Register" name="LCDC_BASECHDR" offset="0x00000044" rw="W" size="4">
          <bitfield caption="Channel Disable Register" mask="0x00000001" name="CHDIS"/>
          <bitfield caption="Channel Reset Register" mask="0x00000100" name="CHRST"/>
        </register>
        <register caption="Base Layer Channel Status Register" name="LCDC_BASECHSR" offset="0x00000048" rw="R" size="4">
          <bitfield caption="Channel Status Register" mask="0x00000001" name="CHSR"/>
          <bitfield caption="Update Overlay Attributes In Progress" mask="0x00000002" name="UPDATESR"/>
          <bitfield caption="Add To Queue Pending Register" mask="0x00000004" name="A2QSR"/>
        </register>
        <register caption="Base Layer Interrupt Enable Register" name="LCDC_BASEIER" offset="0x0000004C" rw="W" size="4">
          <bitfield caption="End of DMA Transfer Interrupt Enable Register" mask="0x00000004" name="DMA"/>
          <bitfield caption="Descriptor Loaded Interrupt Enable Register" mask="0x00000008" name="DSCR"/>
          <bitfield caption="Head Descriptor Loaded Interrupt Enable Register" mask="0x00000010" name="ADD"/>
          <bitfield caption="End of List Interrupt Enable Register" mask="0x00000020" name="DONE"/>
          <bitfield caption="Overflow Interrupt Enable Register" mask="0x00000040" name="OVR"/>
        </register>
        <register caption="Base Layer Interrupt Disabled Register" name="LCDC_BASEIDR" offset="0x00000050" rw="W" size="4">
          <bitfield caption="End of DMA Transfer Interrupt Disable Register" mask="0x00000004" name="DMA"/>
          <bitfield caption="Descriptor Loaded Interrupt Disable Register" mask="0x00000008" name="DSCR"/>
          <bitfield caption="Head Descriptor Loaded Interrupt Disable Register" mask="0x00000010" name="ADD"/>
          <bitfield caption="End of List Interrupt Disable Register" mask="0x00000020" name="DONE"/>
          <bitfield caption="Overflow Interrupt Disable Register" mask="0x00000040" name="OVR"/>
        </register>
        <register caption="Base Layer Interrupt Mask Register" name="LCDC_BASEIMR" offset="0x00000054" rw="R" size="4">
          <bitfield caption="End of DMA Transfer Interrupt Mask Register" mask="0x00000004" name="DMA"/>
          <bitfield caption="Descriptor Loaded Interrupt Mask Register" mask="0x00000008" name="DSCR"/>
          <bitfield caption="Head Descriptor Loaded Interrupt Mask Register" mask="0x00000010" name="ADD"/>
          <bitfield caption="End of List Interrupt Mask Register" mask="0x00000020" name="DONE"/>
          <bitfield caption="Overflow Interrupt Mask Register" mask="0x00000040" name="OVR"/>
        </register>
        <register caption="Base Layer Interrupt status Register" name="LCDC_BASEISR" offset="0x00000058" rw="R" size="4">
          <bitfield caption="End of DMA Transfer" mask="0x00000004" name="DMA"/>
          <bitfield caption="DMA Descriptor Loaded" mask="0x00000008" name="DSCR"/>
          <bitfield caption="Head Descriptor Loaded" mask="0x00000010" name="ADD"/>
          <bitfield caption="End of List Detected" mask="0x00000020" name="DONE"/>
          <bitfield caption="Overflow Detected" mask="0x00000040" name="OVR"/>
        </register>
        <register caption="Base DMA Head Register" name="LCDC_BASEHEAD" offset="0x0000005C" rw="RW" size="4">
          <bitfield caption="DMA Head Pointer" mask="0xFFFFFFFC" name="HEAD"/>
        </register>
        <register caption="Base DMA Address Register" name="LCDC_BASEADDR" offset="0x00000060" rw="RW" size="4">
          <bitfield caption="DMA Transfer Start Address" mask="0xFFFFFFFF" name="ADDR"/>
        </register>
        <register caption="Base DMA Control Register" name="LCDC_BASECTRL" offset="0x00000064" rw="RW" size="4">
          <bitfield caption="Transfer Descriptor Fetch Enable" mask="0x00000001" name="DFETCH"/>
          <bitfield caption="Lookup Table Fetch Enable" mask="0x00000002" name="LFETCH"/>
          <bitfield caption="End of DMA Transfer Interrupt Enable" mask="0x00000004" name="DMAIEN"/>
          <bitfield caption="Descriptor Loaded Interrupt Enable" mask="0x00000008" name="DSCRIEN"/>
          <bitfield caption="Add Head Descriptor to Queue Interrupt Enable" mask="0x00000010" name="ADDIEN"/>
          <bitfield caption="End of List Interrupt Enable" mask="0x00000020" name="DONEIEN"/>
        </register>
        <register caption="Base DMA Next Register" name="LCDC_BASENEXT" offset="0x00000068" rw="RW" size="4">
          <bitfield caption="DMA Descriptor Next Address" mask="0xFFFFFFFF" name="NEXT"/>
        </register>
        <register caption="Base Configuration register 0" name="LCDC_BASECFG0" offset="0x0000006C" rw="RW" size="4">
          <bitfield caption="Source Interface" mask="0x00000001" name="SIF"/>
          <bitfield caption="AHB Burst Length" mask="0x00000030" name="BLEN" values="LCDC_BASECFG0__BLEN"/>
          <bitfield caption="Defined Length Burst Only For Channel Bus Transaction." mask="0x00000100" name="DLBO"/>
        </register>
        <register caption="Base Configuration register 1" name="LCDC_BASECFG1" offset="0x00000070" rw="RW" size="4">
          <bitfield caption="Color Lookup Table Enable" mask="0x00000001" name="CLUTEN"/>
          <bitfield caption="RGB Input Mode Selection" mask="0x000000F0" name="RGBMODE" values="LCDC_BASECFG1__RGBMODE"/>
          <bitfield caption="Color Lookup Table Input Mode Selection" mask="0x00000300" name="CLUTMODE" values="LCDC_BASECFG1__CLUTMODE"/>
        </register>
        <register caption="Base Configuration register 2" name="LCDC_BASECFG2" offset="0x00000074" rw="RW" size="4">
          <bitfield caption="Horizontal Stride" mask="0xFFFFFFFF" name="XSTRIDE"/>
        </register>
        <register caption="Base Configuration register 3" name="LCDC_BASECFG3" offset="0x00000078" rw="RW" size="4">
          <bitfield caption="Blue Default" mask="0x000000FF" name="BDEF"/>
          <bitfield caption="Green Default" mask="0x0000FF00" name="GDEF"/>
          <bitfield caption="Red Default" mask="0x00FF0000" name="RDEF"/>
        </register>
        <register caption="Base Configuration register 4" name="LCDC_BASECFG4" offset="0x0000007C" rw="RW" size="4">
          <bitfield caption="Use DMA Data Path" mask="0x00000100" name="DMA"/>
          <bitfield caption="Use Replication logic to expand RGB color to 24 bits" mask="0x00000200" name="REP"/>
          <bitfield caption="Discard Area Enable" mask="0x00000800" name="DISCEN"/>
        </register>
        <register caption="Base Configuration register 5" name="LCDC_BASECFG5" offset="0x00000080" rw="RW" size="4">
          <bitfield caption="Discard Area horizontal coordinate" mask="0x000007FF" name="DISCXPOS"/>
          <bitfield caption="Discard Area Vertical coordinate" mask="0x07FF0000" name="DISCYPOS"/>
        </register>
        <register caption="Base Configuration register 6" name="LCDC_BASECFG6" offset="0x00000084" rw="RW" size="4">
          <bitfield caption="Discard Area Horizontal Size" mask="0x000007FF" name="DISCXSIZE"/>
          <bitfield caption="Discard Area Vertical Size" mask="0x07FF0000" name="DISCYSIZE"/>
        </register>
        <register caption="Overlay 1 Channel Enable Register" name="LCDC_OVR1CHER" offset="0x00000140" rw="W" size="4">
          <bitfield caption="Channel Enable Register" mask="0x00000001" name="CHEN"/>
          <bitfield caption="Update Overlay Attributes Enable Register" mask="0x00000002" name="UPDATEEN"/>
          <bitfield caption="Add Head Pointer Enable Register" mask="0x00000004" name="A2QEN"/>
        </register>
