MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D33.atdf
        <register caption="Overlay 1 Configuration 4 Register" name="LCDC_OVR1CFG4" offset="0x0000017C" rw="RW" size="4">
          <bitfield caption="Horizontal Stride" mask="0xFFFFFFFF" name="XSTRIDE"/>
        </register>
        <register caption="Overlay 1 Configuration 5 Register" name="LCDC_OVR1CFG5" offset="0x00000180" rw="RW" size="4">
          <bitfield caption="Pixel Stride" mask="0xFFFFFFFF" name="PSTRIDE"/>
        </register>
        <register caption="Overlay 1 Configuration 6 Register" name="LCDC_OVR1CFG6" offset="0x00000184" rw="RW" size="4">
          <bitfield caption="Blue Default" mask="0x000000FF" name="BDEF"/>
          <bitfield caption="Green Default" mask="0x0000FF00" name="GDEF"/>
          <bitfield caption="Red Default" mask="0x00FF0000" name="RDEF"/>
        </register>
        <register caption="Overlay 1 Configuration 7 Register" name="LCDC_OVR1CFG7" offset="0x00000188" rw="RW" size="4">
          <bitfield caption="Blue Color Component Chroma Key" mask="0x000000FF" name="BKEY"/>
          <bitfield caption="Green Color Component Chroma Key" mask="0x0000FF00" name="GKEY"/>
          <bitfield caption="Red Color Component Chroma Key" mask="0x00FF0000" name="RKEY"/>
        </register>
        <register caption="Overlay 1 Configuration 8Register" name="LCDC_OVR1CFG8" offset="0x0000018C" rw="RW" size="4">
          <bitfield caption="Blue Color Component Chroma Key Mask" mask="0x000000FF" name="BMASK"/>
          <bitfield caption="Green Color Component Chroma Key Mask" mask="0x0000FF00" name="GMASK"/>
          <bitfield caption="Red Color Component Chroma Key Mask" mask="0x00FF0000" name="RMASK"/>
        </register>
        <register caption="Overlay 1 Configuration 9 Register" name="LCDC_OVR1CFG9" offset="0x00000190" rw="RW" size="4">
          <bitfield caption="Blender Chroma Key Enable" mask="0x00000001" name="CRKEY"/>
          <bitfield caption="Blender Inverted Blender Output Enable" mask="0x00000002" name="INV"/>
          <bitfield caption="Blender Iterated Color Enable" mask="0x00000004" name="ITER2BL"/>
          <bitfield caption="Blender Use Iterated Color" mask="0x00000008" name="ITER"/>
          <bitfield caption="Blender Reverse Alpha" mask="0x00000010" name="REVALPHA"/>
          <bitfield caption="Blender Global Alpha Enable" mask="0x00000020" name="GAEN"/>
          <bitfield caption="Blender Local Alpha Enable" mask="0x00000040" name="LAEN"/>
          <bitfield caption="Blender Overlay Layer Enable" mask="0x00000080" name="OVR"/>
          <bitfield caption="Blender DMA Layer Enable" mask="0x00000100" name="DMA"/>
          <bitfield caption="Use Replication logic to expand RGB color to 24 bits" mask="0x00000200" name="REP"/>
          <bitfield caption="Destination Chroma Keying" mask="0x00000400" name="DSTKEY"/>
          <bitfield caption="Blender Global Alpha" mask="0x00FF0000" name="GA"/>
        </register>
        <register caption="Overlay 2 Channel Enable Register" name="LCDC_OVR2CHER" offset="0x00000240" rw="W" size="4">
          <bitfield caption="Channel Enable Register" mask="0x00000001" name="CHEN"/>
          <bitfield caption="Update Overlay Attributes Enable Register" mask="0x00000002" name="UPDATEEN"/>
          <bitfield caption="Add Head Pointer Enable Register" mask="0x00000004" name="A2QEN"/>
        </register>
        <register caption="Overlay 2 Channel Disable Register" name="LCDC_OVR2CHDR" offset="0x00000244" rw="W" size="4">
          <bitfield caption="Channel Disable Register" mask="0x00000001" name="CHDIS"/>
          <bitfield caption="Channel Reset Register" mask="0x00000100" name="CHRST"/>
        </register>
        <register caption="Overlay 2 Channel Status Register" name="LCDC_OVR2CHSR" offset="0x00000248" rw="R" size="4">
          <bitfield caption="Channel Status Register" mask="0x00000001" name="CHSR"/>
          <bitfield caption="Update Overlay Attributes In Progress" mask="0x00000002" name="UPDATESR"/>
          <bitfield caption="Add To Queue Pending Register" mask="0x00000004" name="A2QSR"/>
        </register>
        <register caption="Overlay 2 Interrupt Enable Register" name="LCDC_OVR2IER" offset="0x0000024C" rw="W" size="4">
          <bitfield caption="End of DMA Transfer Interrupt Enable Register" mask="0x00000004" name="DMA"/>
          <bitfield caption="Descriptor Loaded Interrupt Enable Register" mask="0x00000008" name="DSCR"/>
          <bitfield caption="Head Descriptor Loaded Interrupt Enable Register" mask="0x00000010" name="ADD"/>
          <bitfield caption="End of List Interrupt Enable Register" mask="0x00000020" name="DONE"/>
          <bitfield caption="Overflow Interrupt Enable Register" mask="0x00000040" name="OVR"/>
        </register>
        <register caption="Overlay 2 Interrupt Disable Register" name="LCDC_OVR2IDR" offset="0x00000250" rw="W" size="4">
          <bitfield caption="End of DMA Transfer Interrupt Disable Register" mask="0x00000004" name="DMA"/>
          <bitfield caption="Descriptor Loaded Interrupt Disable Register" mask="0x00000008" name="DSCR"/>
          <bitfield caption="Head Descriptor Loaded Interrupt Disable Register" mask="0x00000010" name="ADD"/>
          <bitfield caption="End of List Interrupt Disable Register" mask="0x00000020" name="DONE"/>
          <bitfield caption="Overflow Interrupt Disable Register" mask="0x00000040" name="OVR"/>
        </register>
        <register caption="Overlay 2 Interrupt Mask Register" name="LCDC_OVR2IMR" offset="0x00000254" rw="R" size="4">
          <bitfield caption="End of DMA Transfer Interrupt Mask Register" mask="0x00000004" name="DMA"/>
          <bitfield caption="Descriptor Loaded Interrupt Mask Register" mask="0x00000008" name="DSCR"/>
          <bitfield caption="Head Descriptor Loaded Interrupt Mask Register" mask="0x00000010" name="ADD"/>
          <bitfield caption="End of List Interrupt Mask Register" mask="0x00000020" name="DONE"/>
          <bitfield caption="Overflow Interrupt Mask Register" mask="0x00000040" name="OVR"/>
        </register>
        <register caption="Overlay 2 Interrupt status Register" name="LCDC_OVR2ISR" offset="0x00000258" rw="R" size="4">
          <bitfield caption="End of DMA Transfer" mask="0x00000004" name="DMA"/>
          <bitfield caption="DMA Descriptor Loaded" mask="0x00000008" name="DSCR"/>
          <bitfield caption="Head Descriptor Loaded Interrupt Disable Register" mask="0x00000010" name="ADD"/>
          <bitfield caption="End Of List Interrupt Disable Register" mask="0x00000020" name="DONE"/>
          <bitfield caption="Overflow Detected" mask="0x00000040" name="OVR"/>
        </register>
        <register caption="Overlay 2 DMA Head Register" name="LCDC_OVR2HEAD" offset="0x0000025C" rw="RW" size="4">
          <bitfield caption="DMA Head Pointer" mask="0xFFFFFFFC" name="HEAD"/>
        </register>
