MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D33.atdf
        <register caption="Hardware Cursor DMA Control Register" name="LCDC_HCRCTRL" offset="0x00000464" rw="RW" size="4">
          <bitfield caption="Transfer Descriptor Fetch Enable" mask="0x00000001" name="DFETCH"/>
          <bitfield caption="Lookup Table Fetch Enable" mask="0x00000002" name="LFETCH"/>
          <bitfield caption="End of DMA Transfer Interrupt Enable" mask="0x00000004" name="DMAIEN"/>
          <bitfield caption="Descriptor Loaded Interrupt Enable" mask="0x00000008" name="DSCRIEN"/>
          <bitfield caption="Add Head Descriptor to Queue Interrupt Enable" mask="0x00000010" name="ADDIEN"/>
          <bitfield caption="End of List Interrupt Enable" mask="0x00000020" name="DONEIEN"/>
        </register>
        <register caption="Hardware Cursor DMA NExt Register" name="LCDC_HCRNEXT" offset="0x00000468" rw="RW" size="4">
          <bitfield caption="DMA Descriptor Next Address" mask="0xFFFFFFFF" name="NEXT"/>
        </register>
        <register caption="Hardware Cursor Configuration 0 Register" name="LCDC_HCRCFG0" offset="0x0000046C" rw="RW" size="4">
          <bitfield caption="Source Interface" mask="0x00000001" name="SIF"/>
          <bitfield caption="AHB Burst Length" mask="0x00000030" name="BLEN" values="LCDC_HCRCFG0__BLEN"/>
          <bitfield caption="Defined Length Burst Only for Channel Bus Transaction." mask="0x00000100" name="DLBO"/>
        </register>
        <register caption="Hardware Cursor Configuration 1 Register" name="LCDC_HCRCFG1" offset="0x00000470" rw="RW" size="4">
          <bitfield caption="Color Lookup Table Enable" mask="0x00000001" name="CLUTEN"/>
          <bitfield caption="RGB input mode selection" mask="0x000000F0" name="RGBMODE" values="LCDC_HCRCFG1__RGBMODE"/>
          <bitfield caption="Color Lookup table input mode selection" mask="0x00000300" name="CLUTMODE" values="LCDC_HCRCFG1__CLUTMODE"/>
        </register>
        <register caption="Hardware Cursor Configuration 2 Register" name="LCDC_HCRCFG2" offset="0x00000474" rw="RW" size="4">
          <bitfield caption="Horizontal Window Position" mask="0x000007FF" name="XPOS"/>
          <bitfield caption="Vertical Window Position" mask="0x07FF0000" name="YPOS"/>
        </register>
        <register caption="Hardware Cursor Configuration 3 Register" name="LCDC_HCRCFG3" offset="0x00000478" rw="RW" size="4">
          <bitfield caption="Horizontal Window Size" mask="0x000007FF" name="XSIZE"/>
          <bitfield caption="Vertical Window Size" mask="0x07FF0000" name="YSIZE"/>
        </register>
        <register caption="Hardware Cursor Configuration 4 Register" name="LCDC_HCRCFG4" offset="0x0000047C" rw="RW" size="4">
          <bitfield caption="Horizontal Stride" mask="0xFFFFFFFF" name="XSTRIDE"/>
        </register>
        <register caption="Hardware Cursor Configuration 6 Register" name="LCDC_HCRCFG6" offset="0x00000484" rw="RW" size="4">
          <bitfield caption="Blue Default" mask="0x000000FF" name="BDEF"/>
          <bitfield caption="Green Default" mask="0x0000FF00" name="GDEF"/>
          <bitfield caption="Red Default" mask="0x00FF0000" name="RDEF"/>
        </register>
        <register caption="Hardware Cursor Configuration 7 Register" name="LCDC_HCRCFG7" offset="0x00000488" rw="RW" size="4">
          <bitfield caption="Blue Color Component Chroma Key" mask="0x000000FF" name="BKEY"/>
          <bitfield caption="Green Color Component Chroma Key" mask="0x0000FF00" name="GKEY"/>
          <bitfield caption="Red Color Component Chroma Key" mask="0x00FF0000" name="RKEY"/>
        </register>
        <register caption="Hardware Cursor Configuration 8 Register" name="LCDC_HCRCFG8" offset="0x0000048C" rw="RW" size="4">
          <bitfield caption="Blue Color Component Chroma Key Mask" mask="0x000000FF" name="BMASK"/>
          <bitfield caption="Green Color Component Chroma Key Mask" mask="0x0000FF00" name="GMASK"/>
          <bitfield caption="Red Color Component Chroma Key Mask" mask="0x00FF0000" name="RMASK"/>
        </register>
        <register caption="Hardware Cursor Configuration 9 Register" name="LCDC_HCRCFG9" offset="0x00000490" rw="RW" size="4">
          <bitfield caption="Blender Chroma Key Enable" mask="0x00000001" name="CRKEY"/>
          <bitfield caption="Blender Inverted Blender Output Enable" mask="0x00000002" name="INV"/>
          <bitfield caption="Blender Iterated Color Enable" mask="0x00000004" name="ITER2BL"/>
          <bitfield caption="Blender Use Iterated Color" mask="0x00000008" name="ITER"/>
          <bitfield caption="Blender Reverse Alpha" mask="0x00000010" name="REVALPHA"/>
          <bitfield caption="Blender Global Alpha Enable" mask="0x00000020" name="GAEN"/>
          <bitfield caption="Blender Local Alpha Enable" mask="0x00000040" name="LAEN"/>
          <bitfield caption="Blender Overlay Layer Enable" mask="0x00000080" name="OVR"/>
          <bitfield caption="Blender DMA Layer Enable" mask="0x00000100" name="DMA"/>
          <bitfield caption="Use Replication logic to expand RGB color to 24 bits" mask="0x00000200" name="REP"/>
          <bitfield caption="Destination Chroma Keying" mask="0x00000400" name="DSTKEY"/>
          <bitfield caption="Blender Global Alpha" mask="0x00FF0000" name="GA"/>
        </register>
        <register caption="Post Processing Channel Enable Register" name="LCDC_PPCHER" offset="0x00000540" rw="W" size="4">
          <bitfield caption="Channel Enable Register" mask="0x00000001" name="CHEN"/>
          <bitfield caption="Update Overlay Attributes Enable Register" mask="0x00000002" name="UPDATEEN"/>
          <bitfield caption="Add Head Pointer Enable Register" mask="0x00000004" name="A2QEN"/>
        </register>
        <register caption="Post Processing Channel Disable Register" name="LCDC_PPCHDR" offset="0x00000544" rw="W" size="4">
          <bitfield caption="Channel Disable Register" mask="0x00000001" name="CHDIS"/>
          <bitfield caption="Channel Reset Register" mask="0x00000100" name="CHRST"/>
        </register>
        <register caption="Post Processing Channel Status Register" name="LCDC_PPCHSR" offset="0x00000548" rw="R" size="4">
          <bitfield caption="Channel Status Register" mask="0x00000001" name="CHSR"/>
          <bitfield caption="Update Overlay Attributes In Progress" mask="0x00000002" name="UPDATESR"/>
          <bitfield caption="Add To Queue Pending Register" mask="0x00000004" name="A2QSR"/>
        </register>
        <register caption="Post Processing Interrupt Enable Register" name="LCDC_PPIER" offset="0x0000054C" rw="W" size="4">
          <bitfield caption="End of DMA Transfer Interrupt Enable Register" mask="0x00000004" name="DMA"/>
          <bitfield caption="Descriptor Loaded Interrupt Enable Register" mask="0x00000008" name="DSCR"/>
          <bitfield caption="Head Descriptor Loaded Interrupt Enable Register" mask="0x00000010" name="ADD"/>
          <bitfield caption="End of List Interrupt Enable Register" mask="0x00000020" name="DONE"/>
        </register>
        <register caption="Post Processing Interrupt Disable Register" name="LCDC_PPIDR" offset="0x00000550" rw="W" size="4">
          <bitfield caption="End of DMA Transfer Interrupt Disable Register" mask="0x00000004" name="DMA"/>
          <bitfield caption="Descriptor Loaded Interrupt Disable Register" mask="0x00000008" name="DSCR"/>
          <bitfield caption="Head Descriptor Loaded Interrupt Disable Register" mask="0x00000010" name="ADD"/>
          <bitfield caption="End of List Interrupt Disable Register" mask="0x00000020" name="DONE"/>
        </register>
        <register caption="Post Processing Interrupt Mask Register" name="LCDC_PPIMR" offset="0x00000554" rw="R" size="4">
          <bitfield caption="End of DMA Transfer Interrupt Mask Register" mask="0x00000004" name="DMA"/>
          <bitfield caption="Descriptor Loaded Interrupt Mask Register" mask="0x00000008" name="DSCR"/>
          <bitfield caption="Head Descriptor Loaded Interrupt Mask Register" mask="0x00000010" name="ADD"/>
          <bitfield caption="End of List Interrupt Mask Register" mask="0x00000020" name="DONE"/>
        </register>
