MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D33.atdf
        <register caption="Post Processing Interrupt Status Register" name="LCDC_PPISR" offset="0x00000558" rw="R" size="4">
          <bitfield caption="End of DMA Transfer" mask="0x00000004" name="DMA"/>
          <bitfield caption="DMA Descriptor Loaded" mask="0x00000008" name="DSCR"/>
          <bitfield caption="Head Descriptor Loaded" mask="0x00000010" name="ADD"/>
          <bitfield caption="End Of List Detected" mask="0x00000020" name="DONE"/>
        </register>
        <register caption="Post Processing Head Register" name="LCDC_PPHEAD" offset="0x0000055C" rw="RW" size="4">
          <bitfield caption="DMA Head Pointer" mask="0xFFFFFFFC" name="HEAD"/>
        </register>
        <register caption="Post Processing Address Register" name="LCDC_PPADDR" offset="0x00000560" rw="RW" size="4">
          <bitfield caption="DMA Transfer start address" mask="0xFFFFFFFF" name="ADDR"/>
        </register>
        <register caption="Post Processing Control Register" name="LCDC_PPCTRL" offset="0x00000564" rw="RW" size="4">
          <bitfield caption="Transfer Descriptor Fetch Enable" mask="0x00000001" name="DFETCH"/>
          <bitfield caption="End of DMA Transfer Interrupt Enable" mask="0x00000004" name="DMAIEN"/>
          <bitfield caption="Descriptor Loaded Interrupt Enable" mask="0x00000008" name="DSCRIEN"/>
          <bitfield caption="Add Head Descriptor to Queue Interrupt Enable" mask="0x00000010" name="ADDIEN"/>
          <bitfield caption="End of List Interrupt Enable" mask="0x00000020" name="DONEIEN"/>
        </register>
        <register caption="Post Processing Next Register" name="LCDC_PPNEXT" offset="0x00000568" rw="RW" size="4">
          <bitfield caption="DMA Descriptor Next Address" mask="0xFFFFFFFF" name="NEXT"/>
        </register>
        <register caption="Post Processing Configuration Register 0" name="LCDC_PPCFG0" offset="0x0000056C" rw="RW" size="4">
          <bitfield caption="Source Interface" mask="0x00000001" name="SIF"/>
          <bitfield caption="AHB Burst Length" mask="0x00000030" name="BLEN" values="LCDC_PPCFG0__BLEN"/>
          <bitfield caption="Defined Length Burst Only For Channel Bus Transaction." mask="0x00000100" name="DLBO"/>
        </register>
        <register caption="Post Processing Configuration Register 1" name="LCDC_PPCFG1" offset="0x00000570" rw="RW" size="4">
          <bitfield caption="Post Processing Output Format selection" mask="0x00000007" name="PPMODE" values="LCDC_PPCFG1__PPMODE"/>
          <bitfield caption="Color Space Conversion Luminance" mask="0x00000010" name="ITUBT601"/>
        </register>
        <register caption="Post Processing Configuration Register 2" name="LCDC_PPCFG2" offset="0x00000574" rw="RW" size="4">
          <bitfield caption="Horizontal Stride" mask="0xFFFFFFFF" name="XSTRIDE"/>
        </register>
        <register caption="Post Processing Configuration Register 3" name="LCDC_PPCFG3" offset="0x00000578" rw="RW" size="4">
          <bitfield caption="Color Space Conversion R coefficient for Luminance component, signed format, step set to 1/1024" mask="0x000003FF" name="CSCYR"/>
          <bitfield caption="Color Space Conversion G coefficient for Luminance component, signed format, step set to 1/512" mask="0x000FFC00" name="CSCYG"/>
          <bitfield caption="Color Space Conversion B coefficient for Luminance component, signed format, step set to 1/1024" mask="0x3FF00000" name="CSCYB"/>
          <bitfield caption="Color Space Conversion Luminance Offset" mask="0x40000000" name="CSCYOFF"/>
        </register>
        <register caption="Post Processing Configuration Register 4" name="LCDC_PPCFG4" offset="0x0000057C" rw="RW" size="4">
          <bitfield caption="Color Space Conversion R coefficient for Chrominance B component, signed format. (step 1/1024)" mask="0x000003FF" name="CSCUR"/>
          <bitfield caption="Color Space Conversion G coefficient for Chrominance B component, signed format. (step 1/512)" mask="0x000FFC00" name="CSCUG"/>
          <bitfield caption="Color Space Conversion B coefficient for Chrominance B component, signed format. (step 1/512)" mask="0x3FF00000" name="CSCUB"/>
          <bitfield caption="Color Space Conversion Chrominance B Offset" mask="0x40000000" name="CSCUOFF"/>
        </register>
        <register caption="Post Processing Configuration Register 5" name="LCDC_PPCFG5" offset="0x00000580" rw="RW" size="4">
          <bitfield caption="Color Space Conversion R coefficient for Chrominance R component, signed format. (step 1/1024)" mask="0x000003FF" name="CSCVR"/>
          <bitfield caption="Color Space Conversion G coefficient for Chrominance R component, signed format. (step 1/512)" mask="0x000FFC00" name="CSCVG"/>
          <bitfield caption="Color Space Conversion B coefficient for Chrominance R component, signed format. (step 1/1024)" mask="0x3FF00000" name="CSCVB"/>
          <bitfield caption="Color Space Conversion Chrominance R Offset" mask="0x40000000" name="CSCVOFF"/>
        </register>
        <register caption="Base CLUT Register 0" name="LCDC_BASECLUT0" offset="0x600" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
        </register>
        <register caption="Base CLUT Register 1" name="LCDC_BASECLUT1" offset="0x604" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
        </register>
        <register caption="Base CLUT Register 2" name="LCDC_BASECLUT2" offset="0x608" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
        </register>
        <register caption="Base CLUT Register 3" name="LCDC_BASECLUT3" offset="0x60C" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
        </register>
        <register caption="Base CLUT Register 4" name="LCDC_BASECLUT4" offset="0x610" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
        </register>
        <register caption="Base CLUT Register 5" name="LCDC_BASECLUT5" offset="0x614" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
        </register>
        <register caption="Base CLUT Register 6" name="LCDC_BASECLUT6" offset="0x618" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
        </register>
        <register caption="Base CLUT Register 7" name="LCDC_BASECLUT7" offset="0x61C" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
        </register>
        <register caption="Base CLUT Register 8" name="LCDC_BASECLUT8" offset="0x620" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
        </register>
        <register caption="Base CLUT Register 9" name="LCDC_BASECLUT9" offset="0x624" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
        </register>
