MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D33.atdf
        <register caption="Base CLUT Register 146" name="LCDC_BASECLUT146" offset="0x848" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
        </register>
        <register caption="Base CLUT Register 147" name="LCDC_BASECLUT147" offset="0x84C" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
        </register>
        <register caption="Base CLUT Register 148" name="LCDC_BASECLUT148" offset="0x850" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
        </register>
        <register caption="Base CLUT Register 149" name="LCDC_BASECLUT149" offset="0x854" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
        </register>
        <register caption="Base CLUT Register 150" name="LCDC_BASECLUT150" offset="0x858" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
        </register>
        <register caption="Base CLUT Register 151" name="LCDC_BASECLUT151" offset="0x85C" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
        </register>
        <register caption="Base CLUT Register 152" name="LCDC_BASECLUT152" offset="0x860" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
        </register>
        <register caption="Base CLUT Register 153" name="LCDC_BASECLUT153" offset="0x864" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
        </register>
        <register caption="Base CLUT Register 154" name="LCDC_BASECLUT154" offset="0x868" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
        </register>
        <register caption="Base CLUT Register 155" name="LCDC_BASECLUT155" offset="0x86C" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
        </register>
        <register caption="Base CLUT Register 156" name="LCDC_BASECLUT156" offset="0x870" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
        </register>
        <register caption="Base CLUT Register 157" name="LCDC_BASECLUT157" offset="0x874" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
        </register>
        <register caption="Base CLUT Register 158" name="LCDC_BASECLUT158" offset="0x878" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
        </register>
        <register caption="Base CLUT Register 159" name="LCDC_BASECLUT159" offset="0x87C" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
        </register>
        <register caption="Base CLUT Register 160" name="LCDC_BASECLUT160" offset="0x880" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
        </register>
        <register caption="Base CLUT Register 161" name="LCDC_BASECLUT161" offset="0x884" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
        </register>
        <register caption="Base CLUT Register 162" name="LCDC_BASECLUT162" offset="0x888" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
        </register>
        <register caption="Base CLUT Register 163" name="LCDC_BASECLUT163" offset="0x88C" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
        </register>
        <register caption="Base CLUT Register 164" name="LCDC_BASECLUT164" offset="0x890" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
        </register>
        <register caption="Base CLUT Register 165" name="LCDC_BASECLUT165" offset="0x894" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
        </register>
        <register caption="Base CLUT Register 166" name="LCDC_BASECLUT166" offset="0x898" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
        </register>
        <register caption="Base CLUT Register 167" name="LCDC_BASECLUT167" offset="0x89C" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
        </register>
        <register caption="Base CLUT Register 168" name="LCDC_BASECLUT168" offset="0x8A0" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
        </register>
        <register caption="Base CLUT Register 169" name="LCDC_BASECLUT169" offset="0x8A4" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
        </register>
        <register caption="Base CLUT Register 170" name="LCDC_BASECLUT170" offset="0x8A8" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
        </register>
        <register caption="Base CLUT Register 171" name="LCDC_BASECLUT171" offset="0x8AC" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
        </register>
