MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D33.atdf
        <register caption="Overlay 1 CLUT Register 218" name="LCDC_OVR1CLUT218" offset="0xD68" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 1 CLUT Register 219" name="LCDC_OVR1CLUT219" offset="0xD6C" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 1 CLUT Register 220" name="LCDC_OVR1CLUT220" offset="0xD70" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 1 CLUT Register 221" name="LCDC_OVR1CLUT221" offset="0xD74" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 1 CLUT Register 222" name="LCDC_OVR1CLUT222" offset="0xD78" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 1 CLUT Register 223" name="LCDC_OVR1CLUT223" offset="0xD7C" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 1 CLUT Register 224" name="LCDC_OVR1CLUT224" offset="0xD80" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 1 CLUT Register 225" name="LCDC_OVR1CLUT225" offset="0xD84" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 1 CLUT Register 226" name="LCDC_OVR1CLUT226" offset="0xD88" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 1 CLUT Register 227" name="LCDC_OVR1CLUT227" offset="0xD8C" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 1 CLUT Register 228" name="LCDC_OVR1CLUT228" offset="0xD90" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 1 CLUT Register 229" name="LCDC_OVR1CLUT229" offset="0xD94" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 1 CLUT Register 230" name="LCDC_OVR1CLUT230" offset="0xD98" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 1 CLUT Register 231" name="LCDC_OVR1CLUT231" offset="0xD9C" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 1 CLUT Register 232" name="LCDC_OVR1CLUT232" offset="0xDA0" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 1 CLUT Register 233" name="LCDC_OVR1CLUT233" offset="0xDA4" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 1 CLUT Register 234" name="LCDC_OVR1CLUT234" offset="0xDA8" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
