MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D33.atdf
        <register caption="Overlay 2 CLUT Register 195" name="LCDC_OVR2CLUT195" offset="0x110C" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 196" name="LCDC_OVR2CLUT196" offset="0x1110" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 197" name="LCDC_OVR2CLUT197" offset="0x1114" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 198" name="LCDC_OVR2CLUT198" offset="0x1118" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 199" name="LCDC_OVR2CLUT199" offset="0x111C" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 200" name="LCDC_OVR2CLUT200" offset="0x1120" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 201" name="LCDC_OVR2CLUT201" offset="0x1124" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 202" name="LCDC_OVR2CLUT202" offset="0x1128" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 203" name="LCDC_OVR2CLUT203" offset="0x112C" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 204" name="LCDC_OVR2CLUT204" offset="0x1130" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 205" name="LCDC_OVR2CLUT205" offset="0x1134" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 206" name="LCDC_OVR2CLUT206" offset="0x1138" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 207" name="LCDC_OVR2CLUT207" offset="0x113C" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 208" name="LCDC_OVR2CLUT208" offset="0x1140" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
