MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D33.atdf
        <register caption="Overlay 2 CLUT Register 209" name="LCDC_OVR2CLUT209" offset="0x1144" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 210" name="LCDC_OVR2CLUT210" offset="0x1148" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 211" name="LCDC_OVR2CLUT211" offset="0x114C" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 212" name="LCDC_OVR2CLUT212" offset="0x1150" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 213" name="LCDC_OVR2CLUT213" offset="0x1154" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 214" name="LCDC_OVR2CLUT214" offset="0x1158" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 215" name="LCDC_OVR2CLUT215" offset="0x115C" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 216" name="LCDC_OVR2CLUT216" offset="0x1160" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 217" name="LCDC_OVR2CLUT217" offset="0x1164" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 218" name="LCDC_OVR2CLUT218" offset="0x1168" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 219" name="LCDC_OVR2CLUT219" offset="0x116C" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 220" name="LCDC_OVR2CLUT220" offset="0x1170" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 221" name="LCDC_OVR2CLUT221" offset="0x1174" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 222" name="LCDC_OVR2CLUT222" offset="0x1178" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 223" name="LCDC_OVR2CLUT223" offset="0x117C" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 224" name="LCDC_OVR2CLUT224" offset="0x1180" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 225" name="LCDC_OVR2CLUT225" offset="0x1184" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 226" name="LCDC_OVR2CLUT226" offset="0x1188" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 227" name="LCDC_OVR2CLUT227" offset="0x118C" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 228" name="LCDC_OVR2CLUT228" offset="0x1190" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
        <register caption="Overlay 2 CLUT Register 229" name="LCDC_OVR2CLUT229" offset="0x1194" rw="RW" size="4">
          <bitfield caption="Blue Color entry" mask="0x000000FF" name="BCLUT"/>
          <bitfield caption="Green Color entry" mask="0x0000FF00" name="GCLUT"/>
          <bitfield caption="Red Color entry" mask="0x00FF0000" name="RCLUT"/>
          <bitfield caption="Alpha Color entry" mask="0xFF000000" name="ACLUT"/>
        </register>
