MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D33.atdf
        <register caption="Slave Configuration Register 13" name="MATRIX_SCFG13" offset="0x74" rw="RW" size="4">
          <bitfield caption="Maximum Bus Grant Duration for Masters" mask="0x000001FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x003C0000" name="FIXED_DEFMSTR"/>
        </register>
        <register caption="Slave Configuration Register 14" name="MATRIX_SCFG14" offset="0x78" rw="RW" size="4">
          <bitfield caption="Maximum Bus Grant Duration for Masters" mask="0x000001FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x003C0000" name="FIXED_DEFMSTR"/>
        </register>
        <register caption="Slave Configuration Register 15" name="MATRIX_SCFG15" offset="0x7C" rw="RW" size="4">
          <bitfield caption="Maximum Bus Grant Duration for Masters" mask="0x000001FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x003C0000" name="FIXED_DEFMSTR"/>
        </register>
        <register caption="Priority Register A for Slave 0" name="MATRIX_PRAS0" offset="0x0080" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
          <bitfield caption="Master 4 Priority" mask="0x00030000" name="M4PR"/>
          <bitfield caption="Master 5 Priority" mask="0x00300000" name="M5PR"/>
          <bitfield caption="Master 6 Priority" mask="0x03000000" name="M6PR"/>
          <bitfield caption="Master 7 Priority" mask="0x30000000" name="M7PR"/>
        </register>
        <register caption="Priority Register B for Slave 0" name="MATRIX_PRBS0" offset="0x0084" rw="RW" size="4">
          <bitfield caption="Master 8 Priority" mask="0x00000003" name="M8PR"/>
          <bitfield caption="Master 9 Priority" mask="0x00000030" name="M9PR"/>
          <bitfield caption="Master 10 Priority" mask="0x00000300" name="M10PR"/>
          <bitfield caption="Master 11 Priority" mask="0x00003000" name="M11PR"/>
          <bitfield caption="Master 12 Priority" mask="0x00030000" name="M12PR"/>
          <bitfield caption="Master 13 Priority" mask="0x00300000" name="M13PR"/>
          <bitfield caption="Master 14 Priority" mask="0x03000000" name="M14PR"/>
          <bitfield caption="Master 15 Priority" mask="0x30000000" name="M15PR"/>
        </register>
        <register caption="Priority Register A for Slave 1" name="MATRIX_PRAS1" offset="0x0088" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
          <bitfield caption="Master 4 Priority" mask="0x00030000" name="M4PR"/>
          <bitfield caption="Master 5 Priority" mask="0x00300000" name="M5PR"/>
          <bitfield caption="Master 6 Priority" mask="0x03000000" name="M6PR"/>
          <bitfield caption="Master 7 Priority" mask="0x30000000" name="M7PR"/>
        </register>
        <register caption="Priority Register B for Slave 1" name="MATRIX_PRBS1" offset="0x008C" rw="RW" size="4">
          <bitfield caption="Master 8 Priority" mask="0x00000003" name="M8PR"/>
          <bitfield caption="Master 9 Priority" mask="0x00000030" name="M9PR"/>
          <bitfield caption="Master 10 Priority" mask="0x00000300" name="M10PR"/>
          <bitfield caption="Master 11 Priority" mask="0x00003000" name="M11PR"/>
          <bitfield caption="Master 12 Priority" mask="0x00030000" name="M12PR"/>
          <bitfield caption="Master 13 Priority" mask="0x00300000" name="M13PR"/>
          <bitfield caption="Master 14 Priority" mask="0x03000000" name="M14PR"/>
          <bitfield caption="Master 15 Priority" mask="0x30000000" name="M15PR"/>
        </register>
        <register caption="Priority Register A for Slave 2" name="MATRIX_PRAS2" offset="0x0090" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
          <bitfield caption="Master 4 Priority" mask="0x00030000" name="M4PR"/>
          <bitfield caption="Master 5 Priority" mask="0x00300000" name="M5PR"/>
          <bitfield caption="Master 6 Priority" mask="0x03000000" name="M6PR"/>
          <bitfield caption="Master 7 Priority" mask="0x30000000" name="M7PR"/>
        </register>
        <register caption="Priority Register B for Slave 2" name="MATRIX_PRBS2" offset="0x0094" rw="RW" size="4">
          <bitfield caption="Master 8 Priority" mask="0x00000003" name="M8PR"/>
          <bitfield caption="Master 9 Priority" mask="0x00000030" name="M9PR"/>
          <bitfield caption="Master 10 Priority" mask="0x00000300" name="M10PR"/>
          <bitfield caption="Master 11 Priority" mask="0x00003000" name="M11PR"/>
          <bitfield caption="Master 12 Priority" mask="0x00030000" name="M12PR"/>
          <bitfield caption="Master 13 Priority" mask="0x00300000" name="M13PR"/>
          <bitfield caption="Master 14 Priority" mask="0x03000000" name="M14PR"/>
          <bitfield caption="Master 15 Priority" mask="0x30000000" name="M15PR"/>
        </register>
        <register caption="Priority Register A for Slave 3" name="MATRIX_PRAS3" offset="0x0098" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
          <bitfield caption="Master 4 Priority" mask="0x00030000" name="M4PR"/>
          <bitfield caption="Master 5 Priority" mask="0x00300000" name="M5PR"/>
          <bitfield caption="Master 6 Priority" mask="0x03000000" name="M6PR"/>
          <bitfield caption="Master 7 Priority" mask="0x30000000" name="M7PR"/>
        </register>
        <register caption="Priority Register B for Slave 3" name="MATRIX_PRBS3" offset="0x009C" rw="RW" size="4">
          <bitfield caption="Master 8 Priority" mask="0x00000003" name="M8PR"/>
          <bitfield caption="Master 9 Priority" mask="0x00000030" name="M9PR"/>
          <bitfield caption="Master 10 Priority" mask="0x00000300" name="M10PR"/>
          <bitfield caption="Master 11 Priority" mask="0x00003000" name="M11PR"/>
          <bitfield caption="Master 12 Priority" mask="0x00030000" name="M12PR"/>
          <bitfield caption="Master 13 Priority" mask="0x00300000" name="M13PR"/>
          <bitfield caption="Master 14 Priority" mask="0x03000000" name="M14PR"/>
          <bitfield caption="Master 15 Priority" mask="0x30000000" name="M15PR"/>
        </register>
        <register caption="Priority Register A for Slave 4" name="MATRIX_PRAS4" offset="0x00A0" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
          <bitfield caption="Master 4 Priority" mask="0x00030000" name="M4PR"/>
          <bitfield caption="Master 5 Priority" mask="0x00300000" name="M5PR"/>
          <bitfield caption="Master 6 Priority" mask="0x03000000" name="M6PR"/>
          <bitfield caption="Master 7 Priority" mask="0x30000000" name="M7PR"/>
        </register>
        <register caption="Priority Register B for Slave 4" name="MATRIX_PRBS4" offset="0x00A4" rw="RW" size="4">
          <bitfield caption="Master 8 Priority" mask="0x00000003" name="M8PR"/>
          <bitfield caption="Master 9 Priority" mask="0x00000030" name="M9PR"/>
          <bitfield caption="Master 10 Priority" mask="0x00000300" name="M10PR"/>
          <bitfield caption="Master 11 Priority" mask="0x00003000" name="M11PR"/>
          <bitfield caption="Master 12 Priority" mask="0x00030000" name="M12PR"/>
          <bitfield caption="Master 13 Priority" mask="0x00300000" name="M13PR"/>
          <bitfield caption="Master 14 Priority" mask="0x03000000" name="M14PR"/>
          <bitfield caption="Master 15 Priority" mask="0x30000000" name="M15PR"/>
        </register>
        <register caption="Priority Register A for Slave 5" name="MATRIX_PRAS5" offset="0x00A8" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
          <bitfield caption="Master 4 Priority" mask="0x00030000" name="M4PR"/>
          <bitfield caption="Master 5 Priority" mask="0x00300000" name="M5PR"/>
          <bitfield caption="Master 6 Priority" mask="0x03000000" name="M6PR"/>
          <bitfield caption="Master 7 Priority" mask="0x30000000" name="M7PR"/>
        </register>
        <register caption="Priority Register B for Slave 5" name="MATRIX_PRBS5" offset="0x00AC" rw="RW" size="4">
          <bitfield caption="Master 8 Priority" mask="0x00000003" name="M8PR"/>
          <bitfield caption="Master 9 Priority" mask="0x00000030" name="M9PR"/>
          <bitfield caption="Master 10 Priority" mask="0x00000300" name="M10PR"/>
          <bitfield caption="Master 11 Priority" mask="0x00003000" name="M11PR"/>
          <bitfield caption="Master 12 Priority" mask="0x00030000" name="M12PR"/>
          <bitfield caption="Master 13 Priority" mask="0x00300000" name="M13PR"/>
          <bitfield caption="Master 14 Priority" mask="0x03000000" name="M14PR"/>
          <bitfield caption="Master 15 Priority" mask="0x30000000" name="M15PR"/>
        </register>
