MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D33.atdf
        <register caption="MPDDRC DLL Slave 0 Status Register 2" name="MPDDRC_DLL_SxSR2" offset="0x88" rw="R" size="4">
          <bitfield caption="DLL Slave x Delay Correction Overflow Flag" mask="0x00000001" name="SDCOVF"/>
          <bitfield caption="DLL Slave x Delay Correction Underflow Flag" mask="0x00000002" name="SDCUDF"/>
          <bitfield caption="DLL Slave x Delay Correction Error Flag" mask="0x00000004" name="SDERF"/>
          <bitfield caption="DLL Slave x Delay Value" mask="0x0000FF00" name="SDVAL"/>
          <bitfield caption="DLL Slave x Delay Correction Value" mask="0x00FF0000" name="SDCVAL"/>
        </register>
        <register caption="MPDDRC DLL Slave 0 Status Register 3" name="MPDDRC_DLL_SxSR3" offset="0x8C" rw="R" size="4">
          <bitfield caption="DLL Slave x Delay Correction Overflow Flag" mask="0x00000001" name="SDCOVF"/>
          <bitfield caption="DLL Slave x Delay Correction Underflow Flag" mask="0x00000002" name="SDCUDF"/>
          <bitfield caption="DLL Slave x Delay Correction Error Flag" mask="0x00000004" name="SDERF"/>
          <bitfield caption="DLL Slave x Delay Value" mask="0x0000FF00" name="SDVAL"/>
          <bitfield caption="DLL Slave x Delay Correction Value" mask="0x00FF0000" name="SDCVAL"/>
        </register>
        <register caption="MPDDRC Write Protect Control Register" name="MPDDRC_WPCR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection KEY" mask="0xFFFFFF00" name="WPKEY"/>
        </register>
        <register caption="MPDDRC Write Protect Status Register" name="MPDDRC_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="" name="MPDDRC_MR__MODE">
        <value caption="Normal Mode. Any access to the MPDDRC will be decoded normally. To activate this mode, the command must be followed by a write to the DDR-SDRAM." name="NORMAL_CMD" value="0x0"/>
        <value caption="The MPDDRC issues an NOP command when the DDR-SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the DDR-SDRAM." name="NOP_CMD" value="0x1"/>
        <value caption="The MPDDRC issues an &quot;All Banks Precharge&quot; command when the DDR-SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the SDRAM." name="PRCGALL_CMD" value="0x2"/>
        <value caption="The MPDDRC issues a &quot;Load Mode Register&quot; command when the DDR-SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the DDR-SDRAM." name="LMR_CMD" value="0x3"/>
        <value caption="The MPDDRC issues an &quot;Auto-Refresh&quot; Command when the DDR-SDRAM device is accessed regardless of the cycle. Previously, an &quot;All Banks Precharge&quot; command must be issued. To activate this mode, the command must be followed by a write to the DDR-SDRAM." name="RFSH_CMD" value="0x4"/>
        <value caption="The MPDDRC issues an &quot;Extended Load Mode Register&quot; command when the SDRAM device is accessed regardless of the cycle. To activate this mode, the command must be followed by a write to the DDR-SDRAM. The write in the DDR-SDRAM must be done in the appropriate bank." name="EXT_LMR_CMD" value="0x5"/>
        <value caption="Deep power mode: Access to deep power-down mode" name="DEEP_CMD" value="0x6"/>
        <value caption="The MPDDRC issues an &quot;LPDDR2 Mode Register&quot; command when the Low-power DDR2-SDRAM device is accessed regardless of the cycle. To activate this mode, the &quot;Mode Register&quot; command must be followed by a write to the Low-power DDR2-SDRAM." name="LPDDR2_CMD" value="0x7"/>
      </value-group>
      <value-group caption="" name="MPDDRC_CR__NC">
        <value caption="9 DDR column bits" name="_9" value="0x0"/>
        <value caption="10 DDR column bits" name="_10" value="0x1"/>
        <value caption="11 DDR column bits" name="_11" value="0x2"/>
        <value caption="12 DDR column bits" name="_12" value="0x3"/>
      </value-group>
      <value-group caption="" name="MPDDRC_CR__NR">
        <value caption="11 row bits" name="_11" value="0x0"/>
        <value caption="12 row bits" name="_12" value="0x1"/>
        <value caption="13 row bits" name="_13" value="0x2"/>
        <value caption="14 row bits" name="_14" value="0x3"/>
      </value-group>
      <value-group caption="" name="MPDDRC_CR__CAS">
        <value caption="DDR2 CAS Latency 3" name="_3_DDR2" value="0x3"/>
        <value caption="LPDDR2 CAS Latency 3" name="_3_LPDDR2" value="0x3"/>
        <value caption="DDR2 CAS Latency 4" name="_4_DDR2" value="0x4"/>
        <value caption="LPDDR2 CAS Latency 4" name="_4_LPDDR2" value="0x4"/>
        <value caption="DDR2 CAS Latency 5" name="_5_DDR2" value="0x5"/>
        <value caption="LPDDR2 CAS Latency 5" name="_5_LPDDR2" value="0x5"/>
        <value caption="DDR2 CAS Latency 6" name="_6_DDR2" value="0x6"/>
      </value-group>
      <value-group caption="" name="MPDDRC_CR__DLL">
        <value caption="Disable DLL reset." name="RESET_DISABLED" value="0"/>
        <value caption="Enable DLL reset." name="RESET_ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="MPDDRC_CR__ZQ">
        <value caption="Calibration command after initialization" name="INIT" value="0x0"/>
        <value caption="Long calibration" name="LONG" value="0x1"/>
        <value caption="Short calibration" name="SHORT" value="0x2"/>
        <value caption="ZQ Reset" name="RESET" value="0x3"/>
      </value-group>
      <value-group caption="" name="MPDDRC_CR__DQMS">
        <value caption="DQM is not shared with another controller." name="NOT_SHARED" value="0"/>
        <value caption="DQM is shared with another controller." name="SHARED" value="1"/>
      </value-group>
      <value-group caption="" name="MPDDRC_CR__ENRDM">
        <value caption="DQS/DDR_DATA phase error correction is disabled." name="OFF" value="0"/>
        <value caption="DQS/DDR_DATA phase error correction is enabled." name="ON" value="1"/>
      </value-group>
      <value-group caption="" name="MPDDRC_CR__NB">
        <value caption="4 banks" name="_4" value="0"/>
        <value caption="8 banks" name="_8" value="1"/>
      </value-group>
      <value-group caption="" name="MPDDRC_CR__NDQS">
        <value caption="Not DQS is enabled." name="ENABLED" value="0"/>
        <value caption="Not DQS is disabled." name="DISABLED" value="1"/>
      </value-group>
