MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D33.atdf
      <value-group caption="" name="MPDDRC_CR__UNAL">
        <value caption="Unaligned access is not supported." name="UNSUPPORTED" value="0"/>
        <value caption="Unaligned access is supported." name="SUPPORTED" value="1"/>
      </value-group>
      <value-group caption="" name="MPDDRC_LPR__LPCB">
        <value caption="Low-power Feature is inhibited. No power-down, self refresh and deep-power modes are issued to the DDR-SDRAM device." name="DISABLED" value="0x0"/>
        <value caption="The MPDDRC issues a Self Refresh command to the DDR-SDRAM device, the clock(s) is/are de-activated and the CKE signal is set low. The DDR-SDRAM device leaves the self refresh mode when accessed and reenters it after the access." name="SELFREFRESH" value="0x1"/>
        <value caption="The MPDDRC issues a Power-down Command to the DDR-SDRAM device after each access, the CKE signal is set low. The DDR-SDRAM device leaves the power-down mode when accessed and reenters it after the access." name="POWERDOWN" value="0x2"/>
        <value caption="The MPDDRC issues a Deep Power-down command to the Low-power DDR-SDRAM device." name="DEEP_PWD" value="0x3"/>
      </value-group>
      <value-group caption="" name="MPDDRC_LPR__CLK_FR">
        <value caption="Clock(s) is/are not frozen." name="DISABLED" value="0"/>
        <value caption="Clock(s) is/are frozen." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="MPDDRC_LPR__LPDDR2_PWOFF">
        <value caption="No power off sequence applied to LPDDR2." name="DISABLED" value="0"/>
        <value caption="A power off sequence is applied to the LPDDR2 device. CKE is forced low." name="ENABLED" value="1"/>
      </value-group>
      <value-group caption="" name="MPDDRC_LPR__TIMEOUT">
        <value caption="The SDRAM controller activates the SDRAM low-power mode immediately after the end of the last transfer." name="_0" value="0x0"/>
        <value caption="The SDRAM controller activates the SDRAM low-power mode 64 clock cycles after the end of the last transfer." name="_64" value="0x1"/>
        <value caption="The SDRAM controller activates the SDRAM low-power mode 128 clock cycles after the end of the last transfer." name="_128" value="0x2"/>
      </value-group>
      <value-group caption="" name="MPDDRC_LPR__APDE">
        <value caption="Fast Exit." name="FAST" value="0"/>
        <value caption="Low Exit." name="SLOW" value="1"/>
      </value-group>
      <value-group caption="" name="MPDDRC_MD__MD">
        <value caption="Low-power DDR1-SDRAM" name="LPDDR_SDRAM" value="0x3"/>
        <value caption="DDR2-SDRAM" name="DDR2_SDRAM" value="0x6"/>
        <value caption="Low-Power DDR2-SDRAM" name="LPDDR2_SDRAM" value="0x7"/>
      </value-group>
      <value-group caption="" name="MPDDRC_MD__DBW">
        <value caption="Data bus width is 32 bits." name="_32_BITS" value="0"/>
        <value caption="Data bus width is 16 bits." name="_16_BITS" value="1"/>
      </value-group>
      <value-group caption="" name="MPDDRC_IO_CALIBR__RDIV">
        <value caption="RZQ = 34,3 Ohm" name="RZQ_34" value="0x1"/>
        <value caption="RZQ = 40 Ohm" name="RZQ_40" value="0x2"/>
        <value caption="RZQ = 33,3 Ohm" name="RZQ_333" value="0x2"/>
        <value caption="RZQ =48 Ohm" name="RZQ_48" value="0x3"/>
        <value caption="RZQ =60 Ohm" name="RZQ_60" value="0x4"/>
        <value caption="RZQ =50 Ohm" name="RZQ_50" value="0x4"/>
        <value caption="RZQ = 80 Ohm" name="RZQ_80" value="0x6"/>
        <value caption="RZQ = 66,7 Ohm" name="RZQ_667" value="0x6"/>
        <value caption="RZQ = 120 Ohm" name="RZQ_120" value="0x7"/>
        <value caption="RZQ = 100 Ohm" name="RZQ_100" value="0x7"/>
      </value-group>
    </module>
    <module caption="Parallel Input/Output Controller" name="PIO" version="11004G">
      <register-group name="PIO">
        <register caption="PIO Enable Register" name="PIO_PER" offset="0x0000" rw="W" size="4">
          <bitfield caption="PIO Enable" mask="0x00000001" name="P0"/>
          <bitfield caption="PIO Enable" mask="0x00000002" name="P1"/>
          <bitfield caption="PIO Enable" mask="0x00000004" name="P2"/>
          <bitfield caption="PIO Enable" mask="0x00000008" name="P3"/>
          <bitfield caption="PIO Enable" mask="0x00000010" name="P4"/>
          <bitfield caption="PIO Enable" mask="0x00000020" name="P5"/>
          <bitfield caption="PIO Enable" mask="0x00000040" name="P6"/>
          <bitfield caption="PIO Enable" mask="0x00000080" name="P7"/>
          <bitfield caption="PIO Enable" mask="0x00000100" name="P8"/>
          <bitfield caption="PIO Enable" mask="0x00000200" name="P9"/>
          <bitfield caption="PIO Enable" mask="0x00000400" name="P10"/>
          <bitfield caption="PIO Enable" mask="0x00000800" name="P11"/>
          <bitfield caption="PIO Enable" mask="0x00001000" name="P12"/>
          <bitfield caption="PIO Enable" mask="0x00002000" name="P13"/>
          <bitfield caption="PIO Enable" mask="0x00004000" name="P14"/>
          <bitfield caption="PIO Enable" mask="0x00008000" name="P15"/>
          <bitfield caption="PIO Enable" mask="0x00010000" name="P16"/>
          <bitfield caption="PIO Enable" mask="0x00020000" name="P17"/>
          <bitfield caption="PIO Enable" mask="0x00040000" name="P18"/>
          <bitfield caption="PIO Enable" mask="0x00080000" name="P19"/>
          <bitfield caption="PIO Enable" mask="0x00100000" name="P20"/>
          <bitfield caption="PIO Enable" mask="0x00200000" name="P21"/>
          <bitfield caption="PIO Enable" mask="0x00400000" name="P22"/>
          <bitfield caption="PIO Enable" mask="0x00800000" name="P23"/>
          <bitfield caption="PIO Enable" mask="0x01000000" name="P24"/>
          <bitfield caption="PIO Enable" mask="0x02000000" name="P25"/>
          <bitfield caption="PIO Enable" mask="0x04000000" name="P26"/>
          <bitfield caption="PIO Enable" mask="0x08000000" name="P27"/>
          <bitfield caption="PIO Enable" mask="0x10000000" name="P28"/>
          <bitfield caption="PIO Enable" mask="0x20000000" name="P29"/>
          <bitfield caption="PIO Enable" mask="0x40000000" name="P30"/>
          <bitfield caption="PIO Enable" mask="0x80000000" name="P31"/>
        </register>
        <register caption="PIO Disable Register" name="PIO_PDR" offset="0x0004" rw="W" size="4">
          <bitfield caption="PIO Disable" mask="0x00000001" name="P0"/>
          <bitfield caption="PIO Disable" mask="0x00000002" name="P1"/>
          <bitfield caption="PIO Disable" mask="0x00000004" name="P2"/>
          <bitfield caption="PIO Disable" mask="0x00000008" name="P3"/>
          <bitfield caption="PIO Disable" mask="0x00000010" name="P4"/>
          <bitfield caption="PIO Disable" mask="0x00000020" name="P5"/>
          <bitfield caption="PIO Disable" mask="0x00000040" name="P6"/>
          <bitfield caption="PIO Disable" mask="0x00000080" name="P7"/>
          <bitfield caption="PIO Disable" mask="0x00000100" name="P8"/>
          <bitfield caption="PIO Disable" mask="0x00000200" name="P9"/>
          <bitfield caption="PIO Disable" mask="0x00000400" name="P10"/>
          <bitfield caption="PIO Disable" mask="0x00000800" name="P11"/>
          <bitfield caption="PIO Disable" mask="0x00001000" name="P12"/>
          <bitfield caption="PIO Disable" mask="0x00002000" name="P13"/>
          <bitfield caption="PIO Disable" mask="0x00004000" name="P14"/>
          <bitfield caption="PIO Disable" mask="0x00008000" name="P15"/>
          <bitfield caption="PIO Disable" mask="0x00010000" name="P16"/>
          <bitfield caption="PIO Disable" mask="0x00020000" name="P17"/>
          <bitfield caption="PIO Disable" mask="0x00040000" name="P18"/>
          <bitfield caption="PIO Disable" mask="0x00080000" name="P19"/>
          <bitfield caption="PIO Disable" mask="0x00100000" name="P20"/>
          <bitfield caption="PIO Disable" mask="0x00200000" name="P21"/>
          <bitfield caption="PIO Disable" mask="0x00400000" name="P22"/>
          <bitfield caption="PIO Disable" mask="0x00800000" name="P23"/>
          <bitfield caption="PIO Disable" mask="0x01000000" name="P24"/>
          <bitfield caption="PIO Disable" mask="0x02000000" name="P25"/>
          <bitfield caption="PIO Disable" mask="0x04000000" name="P26"/>
          <bitfield caption="PIO Disable" mask="0x08000000" name="P27"/>
          <bitfield caption="PIO Disable" mask="0x10000000" name="P28"/>
          <bitfield caption="PIO Disable" mask="0x20000000" name="P29"/>
          <bitfield caption="PIO Disable" mask="0x40000000" name="P30"/>
          <bitfield caption="PIO Disable" mask="0x80000000" name="P31"/>
        </register>
        <register caption="PIO Status Register" name="PIO_PSR" offset="0x0008" rw="R" size="4">
          <bitfield caption="PIO Status" mask="0x00000001" name="P0"/>
          <bitfield caption="PIO Status" mask="0x00000002" name="P1"/>
          <bitfield caption="PIO Status" mask="0x00000004" name="P2"/>
          <bitfield caption="PIO Status" mask="0x00000008" name="P3"/>
          <bitfield caption="PIO Status" mask="0x00000010" name="P4"/>
          <bitfield caption="PIO Status" mask="0x00000020" name="P5"/>
          <bitfield caption="PIO Status" mask="0x00000040" name="P6"/>
          <bitfield caption="PIO Status" mask="0x00000080" name="P7"/>
          <bitfield caption="PIO Status" mask="0x00000100" name="P8"/>
          <bitfield caption="PIO Status" mask="0x00000200" name="P9"/>
          <bitfield caption="PIO Status" mask="0x00000400" name="P10"/>
          <bitfield caption="PIO Status" mask="0x00000800" name="P11"/>
          <bitfield caption="PIO Status" mask="0x00001000" name="P12"/>
          <bitfield caption="PIO Status" mask="0x00002000" name="P13"/>
          <bitfield caption="PIO Status" mask="0x00004000" name="P14"/>
          <bitfield caption="PIO Status" mask="0x00008000" name="P15"/>
          <bitfield caption="PIO Status" mask="0x00010000" name="P16"/>
          <bitfield caption="PIO Status" mask="0x00020000" name="P17"/>
          <bitfield caption="PIO Status" mask="0x00040000" name="P18"/>
          <bitfield caption="PIO Status" mask="0x00080000" name="P19"/>
          <bitfield caption="PIO Status" mask="0x00100000" name="P20"/>
          <bitfield caption="PIO Status" mask="0x00200000" name="P21"/>
          <bitfield caption="PIO Status" mask="0x00400000" name="P22"/>
          <bitfield caption="PIO Status" mask="0x00800000" name="P23"/>
          <bitfield caption="PIO Status" mask="0x01000000" name="P24"/>
          <bitfield caption="PIO Status" mask="0x02000000" name="P25"/>
          <bitfield caption="PIO Status" mask="0x04000000" name="P26"/>
          <bitfield caption="PIO Status" mask="0x08000000" name="P27"/>
          <bitfield caption="PIO Status" mask="0x10000000" name="P28"/>
          <bitfield caption="PIO Status" mask="0x20000000" name="P29"/>
          <bitfield caption="PIO Status" mask="0x40000000" name="P30"/>
          <bitfield caption="PIO Status" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Output Enable Register" name="PIO_OER" offset="0x0010" rw="W" size="4">
          <bitfield caption="Output Enable" mask="0x00000001" name="P0"/>
          <bitfield caption="Output Enable" mask="0x00000002" name="P1"/>
          <bitfield caption="Output Enable" mask="0x00000004" name="P2"/>
          <bitfield caption="Output Enable" mask="0x00000008" name="P3"/>
          <bitfield caption="Output Enable" mask="0x00000010" name="P4"/>
          <bitfield caption="Output Enable" mask="0x00000020" name="P5"/>
          <bitfield caption="Output Enable" mask="0x00000040" name="P6"/>
          <bitfield caption="Output Enable" mask="0x00000080" name="P7"/>
          <bitfield caption="Output Enable" mask="0x00000100" name="P8"/>
          <bitfield caption="Output Enable" mask="0x00000200" name="P9"/>
          <bitfield caption="Output Enable" mask="0x00000400" name="P10"/>
          <bitfield caption="Output Enable" mask="0x00000800" name="P11"/>
          <bitfield caption="Output Enable" mask="0x00001000" name="P12"/>
          <bitfield caption="Output Enable" mask="0x00002000" name="P13"/>
          <bitfield caption="Output Enable" mask="0x00004000" name="P14"/>
          <bitfield caption="Output Enable" mask="0x00008000" name="P15"/>
          <bitfield caption="Output Enable" mask="0x00010000" name="P16"/>
          <bitfield caption="Output Enable" mask="0x00020000" name="P17"/>
          <bitfield caption="Output Enable" mask="0x00040000" name="P18"/>
          <bitfield caption="Output Enable" mask="0x00080000" name="P19"/>
          <bitfield caption="Output Enable" mask="0x00100000" name="P20"/>
          <bitfield caption="Output Enable" mask="0x00200000" name="P21"/>
          <bitfield caption="Output Enable" mask="0x00400000" name="P22"/>
          <bitfield caption="Output Enable" mask="0x00800000" name="P23"/>
          <bitfield caption="Output Enable" mask="0x01000000" name="P24"/>
          <bitfield caption="Output Enable" mask="0x02000000" name="P25"/>
          <bitfield caption="Output Enable" mask="0x04000000" name="P26"/>
          <bitfield caption="Output Enable" mask="0x08000000" name="P27"/>
          <bitfield caption="Output Enable" mask="0x10000000" name="P28"/>
          <bitfield caption="Output Enable" mask="0x20000000" name="P29"/>
          <bitfield caption="Output Enable" mask="0x40000000" name="P30"/>
          <bitfield caption="Output Enable" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Output Disable Register" name="PIO_ODR" offset="0x0014" rw="W" size="4">
          <bitfield caption="Output Disable" mask="0x00000001" name="P0"/>
          <bitfield caption="Output Disable" mask="0x00000002" name="P1"/>
          <bitfield caption="Output Disable" mask="0x00000004" name="P2"/>
          <bitfield caption="Output Disable" mask="0x00000008" name="P3"/>
          <bitfield caption="Output Disable" mask="0x00000010" name="P4"/>
          <bitfield caption="Output Disable" mask="0x00000020" name="P5"/>
          <bitfield caption="Output Disable" mask="0x00000040" name="P6"/>
          <bitfield caption="Output Disable" mask="0x00000080" name="P7"/>
          <bitfield caption="Output Disable" mask="0x00000100" name="P8"/>
          <bitfield caption="Output Disable" mask="0x00000200" name="P9"/>
          <bitfield caption="Output Disable" mask="0x00000400" name="P10"/>
          <bitfield caption="Output Disable" mask="0x00000800" name="P11"/>
          <bitfield caption="Output Disable" mask="0x00001000" name="P12"/>
          <bitfield caption="Output Disable" mask="0x00002000" name="P13"/>
          <bitfield caption="Output Disable" mask="0x00004000" name="P14"/>
          <bitfield caption="Output Disable" mask="0x00008000" name="P15"/>
          <bitfield caption="Output Disable" mask="0x00010000" name="P16"/>
          <bitfield caption="Output Disable" mask="0x00020000" name="P17"/>
          <bitfield caption="Output Disable" mask="0x00040000" name="P18"/>
          <bitfield caption="Output Disable" mask="0x00080000" name="P19"/>
          <bitfield caption="Output Disable" mask="0x00100000" name="P20"/>
          <bitfield caption="Output Disable" mask="0x00200000" name="P21"/>
          <bitfield caption="Output Disable" mask="0x00400000" name="P22"/>
          <bitfield caption="Output Disable" mask="0x00800000" name="P23"/>
          <bitfield caption="Output Disable" mask="0x01000000" name="P24"/>
          <bitfield caption="Output Disable" mask="0x02000000" name="P25"/>
          <bitfield caption="Output Disable" mask="0x04000000" name="P26"/>
          <bitfield caption="Output Disable" mask="0x08000000" name="P27"/>
          <bitfield caption="Output Disable" mask="0x10000000" name="P28"/>
          <bitfield caption="Output Disable" mask="0x20000000" name="P29"/>
          <bitfield caption="Output Disable" mask="0x40000000" name="P30"/>
          <bitfield caption="Output Disable" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Output Status Register" name="PIO_OSR" offset="0x0018" rw="R" size="4">
          <bitfield caption="Output Status" mask="0x00000001" name="P0"/>
          <bitfield caption="Output Status" mask="0x00000002" name="P1"/>
          <bitfield caption="Output Status" mask="0x00000004" name="P2"/>
          <bitfield caption="Output Status" mask="0x00000008" name="P3"/>
          <bitfield caption="Output Status" mask="0x00000010" name="P4"/>
          <bitfield caption="Output Status" mask="0x00000020" name="P5"/>
          <bitfield caption="Output Status" mask="0x00000040" name="P6"/>
          <bitfield caption="Output Status" mask="0x00000080" name="P7"/>
          <bitfield caption="Output Status" mask="0x00000100" name="P8"/>
          <bitfield caption="Output Status" mask="0x00000200" name="P9"/>
          <bitfield caption="Output Status" mask="0x00000400" name="P10"/>
          <bitfield caption="Output Status" mask="0x00000800" name="P11"/>
          <bitfield caption="Output Status" mask="0x00001000" name="P12"/>
          <bitfield caption="Output Status" mask="0x00002000" name="P13"/>
          <bitfield caption="Output Status" mask="0x00004000" name="P14"/>
          <bitfield caption="Output Status" mask="0x00008000" name="P15"/>
          <bitfield caption="Output Status" mask="0x00010000" name="P16"/>
          <bitfield caption="Output Status" mask="0x00020000" name="P17"/>
          <bitfield caption="Output Status" mask="0x00040000" name="P18"/>
          <bitfield caption="Output Status" mask="0x00080000" name="P19"/>
          <bitfield caption="Output Status" mask="0x00100000" name="P20"/>
          <bitfield caption="Output Status" mask="0x00200000" name="P21"/>
          <bitfield caption="Output Status" mask="0x00400000" name="P22"/>
          <bitfield caption="Output Status" mask="0x00800000" name="P23"/>
          <bitfield caption="Output Status" mask="0x01000000" name="P24"/>
          <bitfield caption="Output Status" mask="0x02000000" name="P25"/>
          <bitfield caption="Output Status" mask="0x04000000" name="P26"/>
          <bitfield caption="Output Status" mask="0x08000000" name="P27"/>
          <bitfield caption="Output Status" mask="0x10000000" name="P28"/>
          <bitfield caption="Output Status" mask="0x20000000" name="P29"/>
          <bitfield caption="Output Status" mask="0x40000000" name="P30"/>
          <bitfield caption="Output Status" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Glitch Input Filter Enable Register" name="PIO_IFER" offset="0x0020" rw="W" size="4">
          <bitfield caption="Input Filter Enable" mask="0x00000001" name="P0"/>
          <bitfield caption="Input Filter Enable" mask="0x00000002" name="P1"/>
          <bitfield caption="Input Filter Enable" mask="0x00000004" name="P2"/>
          <bitfield caption="Input Filter Enable" mask="0x00000008" name="P3"/>
          <bitfield caption="Input Filter Enable" mask="0x00000010" name="P4"/>
          <bitfield caption="Input Filter Enable" mask="0x00000020" name="P5"/>
          <bitfield caption="Input Filter Enable" mask="0x00000040" name="P6"/>
          <bitfield caption="Input Filter Enable" mask="0x00000080" name="P7"/>
          <bitfield caption="Input Filter Enable" mask="0x00000100" name="P8"/>
          <bitfield caption="Input Filter Enable" mask="0x00000200" name="P9"/>
          <bitfield caption="Input Filter Enable" mask="0x00000400" name="P10"/>
          <bitfield caption="Input Filter Enable" mask="0x00000800" name="P11"/>
          <bitfield caption="Input Filter Enable" mask="0x00001000" name="P12"/>
          <bitfield caption="Input Filter Enable" mask="0x00002000" name="P13"/>
          <bitfield caption="Input Filter Enable" mask="0x00004000" name="P14"/>
          <bitfield caption="Input Filter Enable" mask="0x00008000" name="P15"/>
          <bitfield caption="Input Filter Enable" mask="0x00010000" name="P16"/>
          <bitfield caption="Input Filter Enable" mask="0x00020000" name="P17"/>
          <bitfield caption="Input Filter Enable" mask="0x00040000" name="P18"/>
          <bitfield caption="Input Filter Enable" mask="0x00080000" name="P19"/>
          <bitfield caption="Input Filter Enable" mask="0x00100000" name="P20"/>
          <bitfield caption="Input Filter Enable" mask="0x00200000" name="P21"/>
          <bitfield caption="Input Filter Enable" mask="0x00400000" name="P22"/>
          <bitfield caption="Input Filter Enable" mask="0x00800000" name="P23"/>
          <bitfield caption="Input Filter Enable" mask="0x01000000" name="P24"/>
          <bitfield caption="Input Filter Enable" mask="0x02000000" name="P25"/>
          <bitfield caption="Input Filter Enable" mask="0x04000000" name="P26"/>
          <bitfield caption="Input Filter Enable" mask="0x08000000" name="P27"/>
          <bitfield caption="Input Filter Enable" mask="0x10000000" name="P28"/>
          <bitfield caption="Input Filter Enable" mask="0x20000000" name="P29"/>
          <bitfield caption="Input Filter Enable" mask="0x40000000" name="P30"/>
          <bitfield caption="Input Filter Enable" mask="0x80000000" name="P31"/>
        </register>
