MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D33.atdf
        <register caption="Programmable Clock 0 Register 0" name="PMC_PCK0" offset="0x40" rw="RW" size="4">
          <bitfield caption="Master Clock Source Selection" mask="0x00000007" name="CSS" values="PMC_PCK__CSS"/>
          <bitfield caption="Programmable Clock Prescaler" mask="0x00000070" name="PRES" values="PMC_PCK__PRES"/>
        </register>
        <register caption="Programmable Clock 0 Register 1" name="PMC_PCK1" offset="0x44" rw="RW" size="4">
          <bitfield caption="Master Clock Source Selection" mask="0x00000007" name="CSS" values="PMC_PCK__CSS"/>
          <bitfield caption="Programmable Clock Prescaler" mask="0x00000070" name="PRES" values="PMC_PCK__PRES"/>
        </register>
        <register caption="Programmable Clock 0 Register 2" name="PMC_PCK2" offset="0x48" rw="RW" size="4">
          <bitfield caption="Master Clock Source Selection" mask="0x00000007" name="CSS" values="PMC_PCK__CSS"/>
          <bitfield caption="Programmable Clock Prescaler" mask="0x00000070" name="PRES" values="PMC_PCK__PRES"/>
        </register>
        <register caption="Interrupt Enable Register" name="PMC_IER" offset="0x0060" rw="W" size="4">
          <bitfield caption="Main Crystal Oscillator Status Interrupt Enable" mask="0x00000001" name="MOSCXTS"/>
          <bitfield caption="PLLA Lock Interrupt Enable" mask="0x00000002" name="LOCKA"/>
          <bitfield caption="Master Clock Ready Interrupt Enable" mask="0x00000008" name="MCKRDY"/>
          <bitfield caption="UTMI PLL Lock Interrupt Enable" mask="0x00000040" name="LOCKU"/>
          <bitfield caption="Programmable Clock Ready 0 Interrupt Enable" mask="0x00000100" name="PCKRDY0"/>
          <bitfield caption="Programmable Clock Ready 1 Interrupt Enable" mask="0x00000200" name="PCKRDY1"/>
          <bitfield caption="Main Oscillator Selection Status Interrupt Enable" mask="0x00010000" name="MOSCSELS"/>
          <bitfield caption="Main On-Chip RC Status Interrupt Enable" mask="0x00020000" name="MOSCRCS"/>
          <bitfield caption="Clock Failure Detector Event Interrupt Enable" mask="0x00040000" name="CFDEV"/>
        </register>
        <register caption="Interrupt Disable Register" name="PMC_IDR" offset="0x0064" rw="W" size="4">
          <bitfield caption="Main Crystal Oscillator Status Interrupt Disable" mask="0x00000001" name="MOSCXTS"/>
          <bitfield caption="PLLA Lock Interrupt Disable" mask="0x00000002" name="LOCKA"/>
          <bitfield caption="Master Clock Ready Interrupt Disable" mask="0x00000008" name="MCKRDY"/>
          <bitfield caption="UTMI PLL Lock Interrupt Enable" mask="0x00000040" name="LOCKU"/>
          <bitfield caption="Programmable Clock Ready 0 Interrupt Disable" mask="0x00000100" name="PCKRDY0"/>
          <bitfield caption="Programmable Clock Ready 1 Interrupt Disable" mask="0x00000200" name="PCKRDY1"/>
          <bitfield caption="Main Oscillator Selection Status Interrupt Disable" mask="0x00010000" name="MOSCSELS"/>
          <bitfield caption="Main On-Chip RC Status Interrupt Disable" mask="0x00020000" name="MOSCRCS"/>
          <bitfield caption="Clock Failure Detector Event Interrupt Disable" mask="0x00040000" name="CFDEV"/>
        </register>
        <register caption="Status Register" name="PMC_SR" offset="0x0068" rw="R" size="4">
          <bitfield caption="Main XTAL Oscillator Status" mask="0x00000001" name="MOSCXTS"/>
          <bitfield caption="PLLA Lock Status" mask="0x00000002" name="LOCKA"/>
          <bitfield caption="Master Clock Status" mask="0x00000008" name="MCKRDY"/>
          <bitfield caption="UPLL Clock Status" mask="0x00000040" name="LOCKU"/>
          <bitfield caption="Slow Clock Oscillator Selection" mask="0x00000080" name="OSCSELS"/>
          <bitfield caption="Programmable Clock Ready Status" mask="0x00000100" name="PCKRDY0"/>
          <bitfield caption="Programmable Clock Ready Status" mask="0x00000200" name="PCKRDY1"/>
          <bitfield caption="Main Oscillator Selection Status" mask="0x00010000" name="MOSCSELS"/>
          <bitfield caption="Main On-Chip RC Oscillator Status" mask="0x00020000" name="MOSCRCS"/>
          <bitfield caption="Clock Failure Detector Event" mask="0x00040000" name="CFDEV"/>
          <bitfield caption="Clock Failure Detector Status" mask="0x00080000" name="CFDS"/>
          <bitfield caption="Clock Failure Detector Fault Output Status" mask="0x00100000" name="FOS"/>
        </register>
        <register caption="Interrupt Mask Register" name="PMC_IMR" offset="0x006C" rw="R" size="4">
          <bitfield caption="Main Crystal Oscillator Status Interrupt Mask" mask="0x00000001" name="MOSCXTS"/>
          <bitfield caption="PLLA Lock Interrupt Mask" mask="0x00000002" name="LOCKA"/>
          <bitfield caption="Master Clock Ready Interrupt Mask" mask="0x00000008" name="MCKRDY"/>
          <bitfield caption="Programmable Clock Ready 0 Interrupt Mask" mask="0x00000100" name="PCKRDY0"/>
          <bitfield caption="Programmable Clock Ready 1 Interrupt Mask" mask="0x00000200" name="PCKRDY1"/>
          <bitfield caption="Main Oscillator Selection Status Interrupt Mask" mask="0x00010000" name="MOSCSELS"/>
          <bitfield caption="Main On-Chip RC Status Interrupt Mask" mask="0x00020000" name="MOSCRCS"/>
          <bitfield caption="Clock Failure Detector Event Interrupt Mask" mask="0x00040000" name="CFDEV"/>
        </register>
        <register caption="PLL Charge Pump Current Register" name="PMC_PLLICPR" offset="0x0080" rw="W" size="4">
          <bitfield caption="Charge Pump Current" mask="0x00000001" name="ICPLLA"/>
        </register>
        <register caption="Write Protect Mode Register" name="PMC_WPMR" offset="0x00E4" rw="RW" size="4">
          <bitfield caption="Write Protect Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protect KEY" mask="0xFFFFFF00" name="WPKEY"/>
        </register>
        <register caption="Write Protect Status Register" name="PMC_WPSR" offset="0x00E8" rw="R" size="4">
          <bitfield caption="Write Protect Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protect Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
        <register caption="Peripheral Clock Enable Register 1" name="PMC_PCER1" offset="0x00100" rw="W" size="4">
          <bitfield caption="Peripheral Clock 32 Enable" mask="0x00000001" name="PID32"/>
          <bitfield caption="Peripheral Clock 33 Enable" mask="0x00000002" name="PID33"/>
          <bitfield caption="Peripheral Clock 34 Enable" mask="0x00000004" name="PID34"/>
          <bitfield caption="Peripheral Clock 35 Enable" mask="0x00000008" name="PID35"/>
          <bitfield caption="Peripheral Clock 36 Enable" mask="0x00000010" name="PID36"/>
          <bitfield caption="Peripheral Clock 37 Enable" mask="0x00000020" name="PID37"/>
          <bitfield caption="Peripheral Clock 38 Enable" mask="0x00000040" name="PID38"/>
          <bitfield caption="Peripheral Clock 39 Enable" mask="0x00000080" name="PID39"/>
          <bitfield caption="Peripheral Clock 40 Enable" mask="0x00000100" name="PID40"/>
          <bitfield caption="Peripheral Clock 41 Enable" mask="0x00000200" name="PID41"/>
          <bitfield caption="Peripheral Clock 42 Enable" mask="0x00000400" name="PID42"/>
          <bitfield caption="Peripheral Clock 43 Enable" mask="0x00000800" name="PID43"/>
          <bitfield caption="Peripheral Clock 44 Enable" mask="0x00001000" name="PID44"/>
          <bitfield caption="Peripheral Clock 45 Enable" mask="0x00002000" name="PID45"/>
          <bitfield caption="Peripheral Clock 46 Enable" mask="0x00004000" name="PID46"/>
          <bitfield caption="Peripheral Clock 47 Enable" mask="0x00008000" name="PID47"/>
          <bitfield caption="Peripheral Clock 48 Enable" mask="0x00010000" name="PID48"/>
          <bitfield caption="Peripheral Clock 49 Enable" mask="0x00020000" name="PID49"/>
          <bitfield caption="Peripheral Clock 50 Enable" mask="0x00040000" name="PID50"/>
          <bitfield caption="Peripheral Clock 51 Enable" mask="0x00080000" name="PID51"/>
          <bitfield caption="Peripheral Clock 53 Enable" mask="0x00300000" name="PID53"/>
          <bitfield caption="Peripheral Clock 54 Enable" mask="0x00400000" name="PID54"/>
          <bitfield caption="Peripheral Clock 55 Enable" mask="0x00800000" name="PID55"/>
          <bitfield caption="Peripheral Clock 56 Enable" mask="0x01000000" name="PID56"/>
          <bitfield caption="Peripheral Clock 57 Enable" mask="0x02000000" name="PID57"/>
          <bitfield caption="Peripheral Clock 58 Enable" mask="0x04000000" name="PID58"/>
          <bitfield caption="Peripheral Clock 59 Enable" mask="0x08000000" name="PID59"/>
          <bitfield caption="Peripheral Clock 60 Enable" mask="0x10000000" name="PID60"/>
          <bitfield caption="Peripheral Clock 61 Enable" mask="0x20000000" name="PID61"/>
          <bitfield caption="Peripheral Clock 62 Enable" mask="0x40000000" name="PID62"/>
          <bitfield caption="Peripheral Clock 63 Enable" mask="0x80000000" name="PID63"/>
        </register>
        <register caption="Peripheral Clock Disable Register 1" name="PMC_PCDR1" offset="0x00104" rw="W" size="4">
          <bitfield caption="Peripheral Clock 32 Disable" mask="0x00000001" name="PID32"/>
          <bitfield caption="Peripheral Clock 33 Disable" mask="0x00000002" name="PID33"/>
          <bitfield caption="Peripheral Clock 34 Disable" mask="0x00000004" name="PID34"/>
          <bitfield caption="Peripheral Clock 35 Disable" mask="0x00000008" name="PID35"/>
          <bitfield caption="Peripheral Clock 36 Disable" mask="0x00000010" name="PID36"/>
          <bitfield caption="Peripheral Clock 37 Disable" mask="0x00000020" name="PID37"/>
          <bitfield caption="Peripheral Clock 38 Disable" mask="0x00000040" name="PID38"/>
          <bitfield caption="Peripheral Clock 39 Disable" mask="0x00000080" name="PID39"/>
          <bitfield caption="Peripheral Clock 40 Disable" mask="0x00000100" name="PID40"/>
          <bitfield caption="Peripheral Clock 41 Disable" mask="0x00000200" name="PID41"/>
          <bitfield caption="Peripheral Clock 42 Disable" mask="0x00000400" name="PID42"/>
          <bitfield caption="Peripheral Clock 43 Disable" mask="0x00000800" name="PID43"/>
          <bitfield caption="Peripheral Clock 44 Disable" mask="0x00001000" name="PID44"/>
          <bitfield caption="Peripheral Clock 45 Disable" mask="0x00002000" name="PID45"/>
          <bitfield caption="Peripheral Clock 46 Disable" mask="0x00004000" name="PID46"/>
          <bitfield caption="Peripheral Clock 47 Disable" mask="0x00008000" name="PID47"/>
          <bitfield caption="Peripheral Clock 48 Disable" mask="0x00010000" name="PID48"/>
          <bitfield caption="Peripheral Clock 49 Disable" mask="0x00020000" name="PID49"/>
          <bitfield caption="Peripheral Clock 50 Disable" mask="0x00040000" name="PID50"/>
          <bitfield caption="Peripheral Clock 51 Disable" mask="0x00080000" name="PID51"/>
          <bitfield caption="Peripheral Clock 53 Disable" mask="0x00300000" name="PID53"/>
          <bitfield caption="Peripheral Clock 54 Disable" mask="0x00400000" name="PID54"/>
          <bitfield caption="Peripheral Clock 55 Disable" mask="0x00800000" name="PID55"/>
          <bitfield caption="Peripheral Clock 56 Disable" mask="0x01000000" name="PID56"/>
          <bitfield caption="Peripheral Clock 57 Disable" mask="0x02000000" name="PID57"/>
          <bitfield caption="Peripheral Clock 58 Disable" mask="0x04000000" name="PID58"/>
          <bitfield caption="Peripheral Clock 59 Disable" mask="0x08000000" name="PID59"/>
          <bitfield caption="Peripheral Clock 60 Disable" mask="0x10000000" name="PID60"/>
          <bitfield caption="Peripheral Clock 61 Disable" mask="0x20000000" name="PID61"/>
          <bitfield caption="Peripheral Clock 62 Disable" mask="0x40000000" name="PID62"/>
          <bitfield caption="Peripheral Clock 63 Disable" mask="0x80000000" name="PID63"/>
        </register>
