MCHP-MPU-Solutions-SHA/samconf/xml/ATSAMA5D33.atdf
        <register caption="Interrupt Mask Register" name="US_IMR" offset="0x0010" rw="R" size="4">
          <bitfield caption="RXRDY Interrupt Mask" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="TXRDY Interrupt Mask" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Receiver Break Interrupt Mask" mask="0x00000004" name="RXBRK"/>
          <bitfield caption="Overrun Error Interrupt Mask" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Framing Error Interrupt Mask" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Parity Error Interrupt Mask" mask="0x00000080" name="PARE"/>
          <bitfield caption="Time-out Interrupt Mask" mask="0x00000100" name="TIMEOUT"/>
          <bitfield caption="TXEMPTY Interrupt Mask" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Max number of Repetitions Reached Mask" mask="0x00000400" name="ITER"/>
          <bitfield caption="SPI Underrun Error Mask" mask="0x00000400" name="UNRE"/>
          <bitfield caption="Non AcknowledgeInterrupt Mask" mask="0x00002000" name="NACK"/>
          <bitfield caption="Clear to Send Input Change Interrupt Mask" mask="0x00080000" name="CTSIC"/>
          <bitfield caption="Manchester Error or  Interrupt Mask" mask="0x01000000" name="MANE"/>
        </register>
        <register caption="Channel Status Register" name="US_CSR" offset="0x0014" rw="R" size="4">
          <bitfield caption="Receiver Ready" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="Transmitter Ready" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Break Received/End of Break" mask="0x00000004" name="RXBRK"/>
          <bitfield caption="Overrun Error" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Framing Error" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Parity Error" mask="0x00000080" name="PARE"/>
          <bitfield caption="Receiver Time-out" mask="0x00000100" name="TIMEOUT"/>
          <bitfield caption="Transmitter Empty" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Max number of Repetitions Reached" mask="0x00000400" name="ITER"/>
          <bitfield caption="Underrun Error" mask="0x00000400" name="UNRE"/>
          <bitfield caption="Non AcknowledgeInterrupt" mask="0x00002000" name="NACK"/>
          <bitfield caption="Clear to Send Input Change Flag" mask="0x00080000" name="CTSIC"/>
          <bitfield caption="Image of CTS Input" mask="0x00800000" name="CTS"/>
          <bitfield caption="Manchester Error or" mask="0x01000000" name="MANERR"/>
        </register>
        <register caption="Receiver Holding Register" name="US_RHR" offset="0x0018" rw="R" size="4">
          <bitfield caption="Received Character" mask="0x000001FF" name="RXCHR"/>
          <bitfield caption="Received Sync" mask="0x00008000" name="RXSYNH"/>
        </register>
        <register caption="Transmitter Holding Register" name="US_THR" offset="0x001C" rw="W" size="4">
          <bitfield caption="Character to be Transmitted" mask="0x000001FF" name="TXCHR"/>
          <bitfield caption="Sync Field to be transmitted" mask="0x00008000" name="TXSYNH"/>
        </register>
        <register caption="Baud Rate Generator Register" name="US_BRGR" offset="0x0020" rw="RW" size="4">
          <bitfield caption="Clock Divider" mask="0x0000FFFF" name="CD"/>
          <bitfield caption="Fractional Part" mask="0x00070000" name="FP"/>
        </register>
        <register caption="Receiver Time-out Register" name="US_RTOR" offset="0x0024" rw="RW" size="4">
          <bitfield caption="Time-out Value" mask="0x0000FFFF" name="TO"/>
        </register>
        <register caption="Transmitter Timeguard Register" name="US_TTGR" offset="0x0028" rw="RW" size="4">
          <bitfield caption="Timeguard Value" mask="0x000000FF" name="TG"/>
        </register>
        <register caption="FI DI Ratio Register" name="US_FIDI" offset="0x0040" rw="RW" size="4">
          <bitfield caption="FI Over DI Ratio Value" mask="0x000007FF" name="FI_DI_RATIO"/>
        </register>
        <register caption="Number of Errors Register" name="US_NER" offset="0x0044" rw="R" size="4">
          <bitfield caption="Number of Errors" mask="0x000000FF" name="NB_ERRORS"/>
        </register>
        <register caption="IrDA Filter Register" name="US_IF" offset="0x004C" rw="RW" size="4">
          <bitfield caption="IrDA Filter" mask="0x000000FF" name="IRDA_FILTER"/>
        </register>
        <register caption="Manchester Encoder Decoder Register" name="US_MAN" offset="0x0050" rw="RW" size="4">
          <bitfield caption="Transmitter Preamble Length" mask="0x0000000F" name="TX_PL"/>
          <bitfield caption="Transmitter Preamble Pattern" mask="0x00000300" name="TX_PP" values="US_MAN__TX_PP"/>
          <bitfield caption="Transmitter Manchester Polarity" mask="0x00001000" name="TX_MPOL"/>
          <bitfield caption="Receiver Preamble Length" mask="0x000F0000" name="RX_PL"/>
          <bitfield caption="Receiver Preamble Pattern detected" mask="0x03000000" name="RX_PP" values="US_MAN__RX_PP"/>
          <bitfield caption="Receiver Manchester Polarity" mask="0x10000000" name="RX_MPOL"/>
          <bitfield caption="Must Be Set to 1" mask="0x20000000" name="ONE"/>
          <bitfield caption="Drift compensation" mask="0x40000000" name="DRIFT"/>
        </register>
        <register caption="Write Protect Mode Register" name="US_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protect Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protect KEY" mask="0xFFFFFF00" name="WPKEY"/>
        </register>
        <register caption="Write Protect Status Register" name="US_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protect Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protect Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
      </register-group>
      <value-group caption="" name="US_MR__USART_MODE">
        <value caption="Normal mode" name="NORMAL" value="0x0"/>
        <value caption="RS485" name="RS485" value="0x1"/>
        <value caption="Hardware Handshaking" name="HW_HANDSHAKING" value="0x2"/>
        <value caption="IS07816 Protocol: T = 0" name="IS07816_T_0" value="0x4"/>
        <value caption="IS07816 Protocol: T = 1" name="IS07816_T_1" value="0x6"/>
        <value caption="IrDA" name="IRDA" value="0x8"/>
        <value caption="SPI Master" name="SPI_MASTER" value="0xE"/>
        <value caption="SPI Slave" name="SPI_SLAVE" value="0xF"/>
      </value-group>
      <value-group caption="" name="US_MR__USCLKS">
        <value caption="Master Clock MCK is selected" name="MCK" value="0x0"/>
        <value caption="Internal Clock Divided MCK/DIV (DIV=(DIV=8)) is selected" name="DIV" value="0x1"/>
        <value caption="Serial Clock SLK is selected" name="SCK" value="0x3"/>
      </value-group>
